kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
/*
  ------------------------------------------------------------------
   | Peripheral type | Instance name     | Base address | Source  |
  ------------------------------------------------------------------
   | ADC             | ADC               | 0x4002B000   | SIDSC   |
   | AFE             | AFE               | 0x40030000   | SIDSC   |
   | AIPS            | AIPS              | 0x40000000   | SIDSC   |
   | BP              | BP                | 0xE0002000   |  PDF    |
   | CMP             | CMP0              | 0x40072000   | SIDSC   |
   | CMP             | CMP1              | 0x40072008   | SIDSC   |
   | CRC             | CRC               | 0x40034000   | SIDSC   |
   | CoreDebug       | CoreDebug         | 0xE000EDF0   |  PDF    |
   | DMA             | DMA               | 0x40008000   | SIDSC   |
   | DMAMUX          | DMAMUX0           | 0x40021000   | SIDSC   |
   | DMAMUX          | DMAMUX1           | 0x40022000   | SIDSC   |
   | DMAMUX          | DMAMUX2           | 0x40023000   | SIDSC   |
   | DMAMUX          | DMAMUX3           | 0x40024000   | SIDSC   |
   | DWT             | DWT               | 0xE0001000   |  PDF    |
   | EWM             | EWM               | 0x40061000   | SIDSC   |
   | FTFA            | FTFA              | 0x40020000   | SIDSC   |
   | NV              | FTFA_FlashConfig  | 0x400        |  PDF    |
   | GPIO            | GPIOA             | 0x400FF000   | SIDSC   |
   | GPIO            | GPIOB             | 0x400FF001   | SIDSC   |
   | GPIO            | GPIOC             | 0x400FF002   | SIDSC   |
   | GPIO            | GPIOD             | 0x400FF003   | SIDSC   |
   | GPIO            | GPIOE             | 0x400FF040   | SIDSC   |
   | GPIO            | GPIOF             | 0x400FF041   | SIDSC   |
   | GPIO            | GPIOG             | 0x400FF042   | SIDSC   |
   | GPIO            | GPIOH             | 0x400FF043   | SIDSC   |
   | GPIO            | GPIOI             | 0x400FF080   | SIDSC   |
   | I2C             | I2C0              | 0x40067000   | SIDSC   |
   | I2C             | I2C1              | 0x40068000   | SIDSC   |
   | LCD             | LCD               | 0x40043000   | SIDSC   |
   | LLWU            | LLWU              | 0x4007C000   | SIDSC   |
   | LPTMR           | LPTMR             | 0x4003C000   | SIDSC   |
   | MCG             | MCG               | 0x40064000   | SIDSC   |
   | MCM             | MCM               | 0xF0003000   | SIDSC   |
   | MPU             | MPU               | 0x4000A000   | SIDSC   |
   | MTB             | MTB               | 0xF0000000   | SIDSC   |
   | MTBDWT          | MTBDWT            | 0xF0001000   | SIDSC   |
   | NVIC            | NVIC              | 0xE000E100   |  PDF    |
   | OSC             | OSC               | 0x40066000   | SIDSC   |
   | PIT             | PIT0              | 0x4002D000   | SIDSC   |
   | PIT             | PIT1              | 0x4002E000   | SIDSC   |
   | PMC             | PMC               | 0x4007D000   | SIDSC   |
   | PORT            | PORTA             | 0x40046000   | SIDSC   |
   | PORT            | PORTB             | 0x40047000   | SIDSC   |
   | PORT            | PORTC             | 0x40048000   | SIDSC   |
   | PORT            | PORTD             | 0x40049000   | SIDSC   |
   | PORT            | PORTE             | 0x4004A000   | SIDSC   |
   | PORT            | PORTF             | 0x4004B000   | SIDSC   |
   | PORT            | PORTG             | 0x4004C000   | SIDSC   |
   | PORT            | PORTH             | 0x4004D000   | SIDSC   |
   | PORT            | PORTI             | 0x4004E000   | SIDSC   |
   | RCM             | RCM               | 0x4007B000   | SIDSC   |
   | RNG             | RNG               | 0x40029000   | SIDSC   |
   | ROM             | ROM               | 0xF0002000   | SIDSC   |
   | RTC             | RTC               | 0x40050000   | SIDSC   |
   | SIM             | SIM               | 0x4003E000   | SIDSC   |
   | SMC             | SMC               | 0x4007E000   | SIDSC   |
   | SPI             | SPI0              | 0x40075000   | SIDSC   |
   | SPI             | SPI1              | 0x40076000   | SIDSC   |
   | SysTick         | SysTick           | 0xE000E010   |  PDF    |
   | SCB             | SystemControl     | 0xE000E000   |  PDF    |
   | TMR             | TMR0              | 0x40057000   | SIDSC   |
   | TMR             | TMR1              | 0x40058000   | SIDSC   |
   | TMR             | TMR2              | 0x40059000   | SIDSC   |
   | TMR             | TMR3              | 0x4005A000   | SIDSC   |
   | UART            | UART0             | 0x4006A000   | SIDSC   |
   | UART            | UART1             | 0x4006B000   | SIDSC   |
   | UART            | UART2             | 0x4006C000   | SIDSC   |
   | UART            | UART3             | 0x4006D000   | SIDSC   |
   | VREF            | VREF              | 0x4006F000   | SIDSC   |
   | WDOG            | WDOG              | 0x40053000   | SIDSC   |
   | XBAR            | XBAR              | 0x40055000   | SIDSC   |
   | ADC             | ADC               | 0x4002B000   | SIDSC   |
   | AFE             | AFE               | 0x40030000   | SIDSC   |
   | AIPS            | AIPS              | 0x40000000   | SIDSC   |
   | BP              | BP                | 0xE0002000   |  PDF    |
   | CMP             | CMP0              | 0x40072000   | SIDSC   |
   | CMP             | CMP1              | 0x40072008   | SIDSC   |
   | CRC             | CRC               | 0x40034000   | SIDSC   |
   | CoreDebug       | CoreDebug         | 0xE000EDF0   |  PDF    |
   | DMA             | DMA               | 0x40008000   | SIDSC   |
   | DMAMUX          | DMAMUX0           | 0x40021000   | SIDSC   |
   | DMAMUX          | DMAMUX1           | 0x40022000   | SIDSC   |
   | DMAMUX          | DMAMUX2           | 0x40023000   | SIDSC   |
   | DMAMUX          | DMAMUX3           | 0x40024000   | SIDSC   |
   | DWT             | DWT               | 0xE0001000   |  PDF    |
   | EWM             | EWM               | 0x40061000   | SIDSC   |
   | FTFA            | FTFA              | 0x40020000   | SIDSC   |
   | NV              | FTFA_FlashConfig  | 0x400        |  PDF    |
   | GPIO            | GPIOA             | 0x400FF000   | SIDSC   |
   | GPIO            | GPIOB             | 0x400FF001   | SIDSC   |
   | GPIO            | GPIOC             | 0x400FF002   | SIDSC   |
   | GPIO            | GPIOD             | 0x400FF003   | SIDSC   |
   | GPIO            | GPIOE             | 0x400FF040   | SIDSC   |
   | GPIO            | GPIOF             | 0x400FF041   | SIDSC   |
   | GPIO            | GPIOG             | 0x400FF042   | SIDSC   |
   | GPIO            | GPIOH             | 0x400FF043   | SIDSC   |
   | GPIO            | GPIOI             | 0x400FF080   | SIDSC   |
   | I2C             | I2C0              | 0x40067000   | SIDSC   |
   | I2C             | I2C1              | 0x40068000   | SIDSC   |
   | LCD             | LCD               | 0x40043000   | SIDSC   |
   | LLWU            | LLWU              | 0x4007C000   | SIDSC   |
   | LPTMR           | LPTMR             | 0x4003C000   | SIDSC   |
   | MCG             | MCG               | 0x40064000   | SIDSC   |
   | MCM             | MCM               | 0xF0003000   | SIDSC   |
   | MPU             | MPU               | 0x4000A000   | SIDSC   |
   | MTB             | MTB               | 0xF0000000   | SIDSC   |
   | MTBDWT          | MTBDWT            | 0xF0001000   | SIDSC   |
   | NVIC            | NVIC              | 0xE000E100   |  PDF    |
   | OSC             | OSC               | 0x40066000   | SIDSC   |
   | PIT             | PIT0              | 0x4002D000   | SIDSC   |
   | PIT             | PIT1              | 0x4002E000   | SIDSC   |
   | PMC             | PMC               | 0x4007D000   | SIDSC   |
   | PORT            | PORTA             | 0x40046000   | SIDSC   |
   | PORT            | PORTB             | 0x40047000   | SIDSC   |
   | PORT            | PORTC             | 0x40048000   | SIDSC   |
   | PORT            | PORTD             | 0x40049000   | SIDSC   |
   | PORT            | PORTE             | 0x4004A000   | SIDSC   |
   | PORT            | PORTF             | 0x4004B000   | SIDSC   |
   | PORT            | PORTG             | 0x4004C000   | SIDSC   |
   | PORT            | PORTH             | 0x4004D000   | SIDSC   |
   | PORT            | PORTI             | 0x4004E000   | SIDSC   |
   | RCM             | RCM               | 0x4007B000   | SIDSC   |
   | RNG             | RNG               | 0x40029000   | SIDSC   |
   | ROM             | ROM               | 0xF0002000   | SIDSC   |
   | RTC             | RTC               | 0x40050000   | SIDSC   |
   | SIM             | SIM               | 0x4003E000   | SIDSC   |
   | SMC             | SMC               | 0x4007E000   | SIDSC   |
   | SPI             | SPI0              | 0x40075000   | SIDSC   |
   | SPI             | SPI1              | 0x40076000   | SIDSC   |
   | SysTick         | SysTick           | 0xE000E010   |  PDF    |
   | SCB             | SystemControl     | 0xE000E000   |  PDF    |
   | TMR             | TMR0              | 0x40057000   | SIDSC   |
   | TMR             | TMR1              | 0x40058000   | SIDSC   |
   | TMR             | TMR2              | 0x40059000   | SIDSC   |
   | TMR             | TMR3              | 0x4005A000   | SIDSC   |
   | UART            | UART0             | 0x4006A000   | SIDSC   |
   | UART            | UART1             | 0x4006B000   | SIDSC   |
   | UART            | UART2             | 0x4006C000   | SIDSC   |
   | UART            | UART3             | 0x4006D000   | SIDSC   |
   | VREF            | VREF              | 0x4006F000   | SIDSC   |
   | WDOG            | WDOG              | 0x40053000   | SIDSC   |
   | XBAR            | XBAR              | 0x40055000   | SIDSC   |
  ------------------------------------------------------------------
*/

#include "MKM33Z5.h"

void test_ADC(void) {
  (void)ADC_BASE_PTR;
  ADC_SC1A = ADC_SC1A + 1;
  ADC_SC1B = ADC_SC1B + 1;
  ADC_SC1C = ADC_SC1C + 1;
  ADC_SC1D = ADC_SC1D + 1;
  ADC_CFG1 = ADC_CFG1 + 1;
  ADC_CFG2 = ADC_CFG2 + 1;
  ADC_CV1 = ADC_CV1 + 1;
  ADC_CV2 = ADC_CV2 + 1;
  ADC_SC2 = ADC_SC2 + 1;
  ADC_SC3 = ADC_SC3 + 1;
  ADC_OFS = ADC_OFS + 1;
  ADC_PG = ADC_PG + 1;
  ADC_CLPD = ADC_CLPD + 1;
  ADC_CLPS = ADC_CLPS + 1;
  ADC_CLP4 = ADC_CLP4 + 1;
  ADC_CLP3 = ADC_CLP3 + 1;
  ADC_CLP2 = ADC_CLP2 + 1;
  ADC_CLP1 = ADC_CLP1 + 1;
  ADC_CLP0 = ADC_CLP0 + 1;
  ADC_SC1_REG(ADC_BASE_PTR,0) = ADC_SC1_REG(ADC_BASE_PTR,0) + 1;
  ADC_SC1(0) = ADC_SC1(0) + 1;
  (void)ADC_SC1_ADCH_MASK;
  (void)ADC_SC1_ADCH_SHIFT;
  (void)ADC_SC1_ADCH(1);
  ADC_SC1A |= ADC_SC1_ADCH_MASK;
  ADC_SC1A &= ~(1U << ADC_SC1_ADCH_SHIFT);
  (void)ADC_SC1_AIEN_MASK;
  (void)ADC_SC1_AIEN_SHIFT;
  ADC_SC1A |= ADC_SC1_AIEN_MASK;
  ADC_SC1A &= ~(1U << ADC_SC1_AIEN_SHIFT);
  (void)ADC_SC1_COCO_MASK;
  (void)ADC_SC1_COCO_SHIFT;
  ADC_SC1A |= ADC_SC1_COCO_MASK;
  ADC_SC1A &= ~(1U << ADC_SC1_COCO_SHIFT);
  ADC_CFG1_REG(ADC_BASE_PTR) = ADC_CFG1_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CFG1_ADICLK_MASK;
  (void)ADC_CFG1_ADICLK_SHIFT;
  (void)ADC_CFG1_ADICLK(1);
  ADC_CFG1 |= ADC_CFG1_ADICLK_MASK;
  ADC_CFG1 &= ~(1U << ADC_CFG1_ADICLK_SHIFT);
  (void)ADC_CFG1_MODE_MASK;
  (void)ADC_CFG1_MODE_SHIFT;
  (void)ADC_CFG1_MODE(1);
  ADC_CFG1 |= ADC_CFG1_MODE_MASK;
  ADC_CFG1 &= ~(1U << ADC_CFG1_MODE_SHIFT);
  (void)ADC_CFG1_ADLSMP_MASK;
  (void)ADC_CFG1_ADLSMP_SHIFT;
  ADC_CFG1 |= ADC_CFG1_ADLSMP_MASK;
  ADC_CFG1 &= ~(1U << ADC_CFG1_ADLSMP_SHIFT);
  (void)ADC_CFG1_ADIV_MASK;
  (void)ADC_CFG1_ADIV_SHIFT;
  (void)ADC_CFG1_ADIV(1);
  ADC_CFG1 |= ADC_CFG1_ADIV_MASK;
  ADC_CFG1 &= ~(1U << ADC_CFG1_ADIV_SHIFT);
  (void)ADC_CFG1_ADLPC_MASK;
  (void)ADC_CFG1_ADLPC_SHIFT;
  ADC_CFG1 |= ADC_CFG1_ADLPC_MASK;
  ADC_CFG1 &= ~(1U << ADC_CFG1_ADLPC_SHIFT);
  ADC_CFG2_REG(ADC_BASE_PTR) = ADC_CFG2_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CFG2_ADLSTS_MASK;
  (void)ADC_CFG2_ADLSTS_SHIFT;
  (void)ADC_CFG2_ADLSTS(1);
  ADC_CFG2 |= ADC_CFG2_ADLSTS_MASK;
  ADC_CFG2 &= ~(1U << ADC_CFG2_ADLSTS_SHIFT);
  (void)ADC_CFG2_ADHSC_MASK;
  (void)ADC_CFG2_ADHSC_SHIFT;
  ADC_CFG2 |= ADC_CFG2_ADHSC_MASK;
  ADC_CFG2 &= ~(1U << ADC_CFG2_ADHSC_SHIFT);
  (void)ADC_CFG2_ADACKEN_MASK;
  (void)ADC_CFG2_ADACKEN_SHIFT;
  ADC_CFG2 |= ADC_CFG2_ADACKEN_MASK;
  ADC_CFG2 &= ~(1U << ADC_CFG2_ADACKEN_SHIFT);
  (void)ADC_CFG2_MUXSEL_MASK;
  (void)ADC_CFG2_MUXSEL_SHIFT;
  ADC_CFG2 |= ADC_CFG2_MUXSEL_MASK;
  ADC_CFG2 &= ~(1U << ADC_CFG2_MUXSEL_SHIFT);
  (void)ADC_R_D_MASK;
  (void)ADC_R_D_SHIFT;
  (void)ADC_R_D(1);
  ADC_RA |= ADC_R_D_MASK;
  ADC_RA &= ~(1U << ADC_R_D_SHIFT);
  ADC_CV1_REG(ADC_BASE_PTR) = ADC_CV1_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CV1_CV_MASK;
  (void)ADC_CV1_CV_SHIFT;
  (void)ADC_CV1_CV(1);
  ADC_CV1 |= ADC_CV1_CV_MASK;
  ADC_CV1 &= ~(1U << ADC_CV1_CV_SHIFT);
  ADC_CV2_REG(ADC_BASE_PTR) = ADC_CV2_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CV2_CV_MASK;
  (void)ADC_CV2_CV_SHIFT;
  (void)ADC_CV2_CV(1);
  ADC_CV2 |= ADC_CV2_CV_MASK;
  ADC_CV2 &= ~(1U << ADC_CV2_CV_SHIFT);
  ADC_SC2_REG(ADC_BASE_PTR) = ADC_SC2_REG(ADC_BASE_PTR) + 1;
  (void)ADC_SC2_REFSEL_MASK;
  (void)ADC_SC2_REFSEL_SHIFT;
  (void)ADC_SC2_REFSEL(1);
  ADC_SC2 |= ADC_SC2_REFSEL_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_REFSEL_SHIFT);
  (void)ADC_SC2_DMAEN_MASK;
  (void)ADC_SC2_DMAEN_SHIFT;
  ADC_SC2 |= ADC_SC2_DMAEN_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_DMAEN_SHIFT);
  (void)ADC_SC2_ACREN_MASK;
  (void)ADC_SC2_ACREN_SHIFT;
  ADC_SC2 |= ADC_SC2_ACREN_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_ACREN_SHIFT);
  (void)ADC_SC2_ACFGT_MASK;
  (void)ADC_SC2_ACFGT_SHIFT;
  ADC_SC2 |= ADC_SC2_ACFGT_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_ACFGT_SHIFT);
  (void)ADC_SC2_ACFE_MASK;
  (void)ADC_SC2_ACFE_SHIFT;
  ADC_SC2 |= ADC_SC2_ACFE_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_ACFE_SHIFT);
  (void)ADC_SC2_ADTRG_MASK;
  (void)ADC_SC2_ADTRG_SHIFT;
  ADC_SC2 |= ADC_SC2_ADTRG_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_ADTRG_SHIFT);
  (void)ADC_SC2_ADACT_MASK;
  (void)ADC_SC2_ADACT_SHIFT;
  ADC_SC2 |= ADC_SC2_ADACT_MASK;
  ADC_SC2 &= ~(1U << ADC_SC2_ADACT_SHIFT);
  ADC_SC3_REG(ADC_BASE_PTR) = ADC_SC3_REG(ADC_BASE_PTR) + 1;
  (void)ADC_SC3_AVGS_MASK;
  (void)ADC_SC3_AVGS_SHIFT;
  (void)ADC_SC3_AVGS(1);
  ADC_SC3 |= ADC_SC3_AVGS_MASK;
  ADC_SC3 &= ~(1U << ADC_SC3_AVGS_SHIFT);
  (void)ADC_SC3_AVGE_MASK;
  (void)ADC_SC3_AVGE_SHIFT;
  ADC_SC3 |= ADC_SC3_AVGE_MASK;
  ADC_SC3 &= ~(1U << ADC_SC3_AVGE_SHIFT);
  (void)ADC_SC3_ADCO_MASK;
  (void)ADC_SC3_ADCO_SHIFT;
  ADC_SC3 |= ADC_SC3_ADCO_MASK;
  ADC_SC3 &= ~(1U << ADC_SC3_ADCO_SHIFT);
  (void)ADC_SC3_CALF_MASK;
  (void)ADC_SC3_CALF_SHIFT;
  ADC_SC3 |= ADC_SC3_CALF_MASK;
  ADC_SC3 &= ~(1U << ADC_SC3_CALF_SHIFT);
  (void)ADC_SC3_CAL_MASK;
  (void)ADC_SC3_CAL_SHIFT;
  ADC_SC3 |= ADC_SC3_CAL_MASK;
  ADC_SC3 &= ~(1U << ADC_SC3_CAL_SHIFT);
  ADC_OFS_REG(ADC_BASE_PTR) = ADC_OFS_REG(ADC_BASE_PTR) + 1;
  (void)ADC_OFS_OFS_MASK;
  (void)ADC_OFS_OFS_SHIFT;
  (void)ADC_OFS_OFS(1);
  ADC_OFS |= ADC_OFS_OFS_MASK;
  ADC_OFS &= ~(1U << ADC_OFS_OFS_SHIFT);
  ADC_PG_REG(ADC_BASE_PTR) = ADC_PG_REG(ADC_BASE_PTR) + 1;
  (void)ADC_PG_PG_MASK;
  (void)ADC_PG_PG_SHIFT;
  (void)ADC_PG_PG(1);
  ADC_PG |= ADC_PG_PG_MASK;
  ADC_PG &= ~(1U << ADC_PG_PG_SHIFT);
  ADC_CLPD_REG(ADC_BASE_PTR) = ADC_CLPD_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLPD_CLPD_MASK;
  (void)ADC_CLPD_CLPD_SHIFT;
  (void)ADC_CLPD_CLPD(1);
  ADC_CLPD |= ADC_CLPD_CLPD_MASK;
  ADC_CLPD &= ~(1U << ADC_CLPD_CLPD_SHIFT);
  ADC_CLPS_REG(ADC_BASE_PTR) = ADC_CLPS_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLPS_CLPS_MASK;
  (void)ADC_CLPS_CLPS_SHIFT;
  (void)ADC_CLPS_CLPS(1);
  ADC_CLPS |= ADC_CLPS_CLPS_MASK;
  ADC_CLPS &= ~(1U << ADC_CLPS_CLPS_SHIFT);
  ADC_CLP4_REG(ADC_BASE_PTR) = ADC_CLP4_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLP4_CLP4_MASK;
  (void)ADC_CLP4_CLP4_SHIFT;
  (void)ADC_CLP4_CLP4(1);
  ADC_CLP4 |= ADC_CLP4_CLP4_MASK;
  ADC_CLP4 &= ~(1U << ADC_CLP4_CLP4_SHIFT);
  ADC_CLP3_REG(ADC_BASE_PTR) = ADC_CLP3_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLP3_CLP3_MASK;
  (void)ADC_CLP3_CLP3_SHIFT;
  (void)ADC_CLP3_CLP3(1);
  ADC_CLP3 |= ADC_CLP3_CLP3_MASK;
  ADC_CLP3 &= ~(1U << ADC_CLP3_CLP3_SHIFT);
  ADC_CLP2_REG(ADC_BASE_PTR) = ADC_CLP2_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLP2_CLP2_MASK;
  (void)ADC_CLP2_CLP2_SHIFT;
  (void)ADC_CLP2_CLP2(1);
  ADC_CLP2 |= ADC_CLP2_CLP2_MASK;
  ADC_CLP2 &= ~(1U << ADC_CLP2_CLP2_SHIFT);
  ADC_CLP1_REG(ADC_BASE_PTR) = ADC_CLP1_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLP1_CLP1_MASK;
  (void)ADC_CLP1_CLP1_SHIFT;
  (void)ADC_CLP1_CLP1(1);
  ADC_CLP1 |= ADC_CLP1_CLP1_MASK;
  ADC_CLP1 &= ~(1U << ADC_CLP1_CLP1_SHIFT);
  ADC_CLP0_REG(ADC_BASE_PTR) = ADC_CLP0_REG(ADC_BASE_PTR) + 1;
  (void)ADC_CLP0_CLP0_MASK;
  (void)ADC_CLP0_CLP0_SHIFT;
  (void)ADC_CLP0_CLP0(1);
  ADC_CLP0 |= ADC_CLP0_CLP0_MASK;
  ADC_CLP0 &= ~(1U << ADC_CLP0_CLP0_SHIFT);
}

void test_AFE(void) {
  (void)AFE_BASE_PTR;
  AFE_CH0_CFR = AFE_CH0_CFR + 1;
  AFE_CH1_CFR = AFE_CH1_CFR + 1;
  AFE_CH2_CFR = AFE_CH2_CFR + 1;
  AFE_CH3_CFR = AFE_CH3_CFR + 1;
  AFE_CR = AFE_CR + 1;
  AFE_CKR = AFE_CKR + 1;
  AFE_DI = AFE_DI + 1;
  AFE_CH0_DR = AFE_CH0_DR + 1;
  AFE_CH1_DR = AFE_CH1_DR + 1;
  AFE_CH2_DR = AFE_CH2_DR + 1;
  AFE_CH3_DR = AFE_CH3_DR + 1;
  AFE_CFR_REG(AFE_BASE_PTR,0) = AFE_CFR_REG(AFE_BASE_PTR,0) + 1;
  AFE_CFR(0) = AFE_CFR(0) + 1;
  (void)AFE_CFR_HW_TRG_MASK;
  (void)AFE_CFR_HW_TRG_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_HW_TRG_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_HW_TRG_SHIFT);
  (void)AFE_CFR_DEC_CLK_INP_SEL_MASK;
  (void)AFE_CFR_DEC_CLK_INP_SEL_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_DEC_CLK_INP_SEL_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_DEC_CLK_INP_SEL_SHIFT);
  (void)AFE_CFR_DEC_CLK_EDGE_SEL_MASK;
  (void)AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_DEC_CLK_EDGE_SEL_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_DEC_CLK_EDGE_SEL_SHIFT);
  (void)AFE_CFR_CC_MASK;
  (void)AFE_CFR_CC_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_CC_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_CC_SHIFT);
  (void)AFE_CFR_DEC_EN_MASK;
  (void)AFE_CFR_DEC_EN_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_DEC_EN_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_DEC_EN_SHIFT);
  (void)AFE_CFR_SD_MOD_EN_MASK;
  (void)AFE_CFR_SD_MOD_EN_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_SD_MOD_EN_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_SD_MOD_EN_SHIFT);
  (void)AFE_CFR_BYP_MODE_MASK;
  (void)AFE_CFR_BYP_MODE_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_BYP_MODE_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_BYP_MODE_SHIFT);
  (void)AFE_CFR_PGA_GAIN_SEL_MASK;
  (void)AFE_CFR_PGA_GAIN_SEL_SHIFT;
  (void)AFE_CFR_PGA_GAIN_SEL(1);
  AFE_CH0_CFR |= AFE_CFR_PGA_GAIN_SEL_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_PGA_GAIN_SEL_SHIFT);
  (void)AFE_CFR_PGA_EN_MASK;
  (void)AFE_CFR_PGA_EN_SHIFT;
  AFE_CH0_CFR |= AFE_CFR_PGA_EN_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_PGA_EN_SHIFT);
  (void)AFE_CFR_DEC_OSR_MASK;
  (void)AFE_CFR_DEC_OSR_SHIFT;
  (void)AFE_CFR_DEC_OSR(1);
  AFE_CH0_CFR |= AFE_CFR_DEC_OSR_MASK;
  AFE_CH0_CFR &= ~(1U << AFE_CFR_DEC_OSR_SHIFT);
  AFE_CR_REG(AFE_BASE_PTR) = AFE_CR_REG(AFE_BASE_PTR) + 1;
  (void)AFE_CR_STRTUP_CNT_MASK;
  (void)AFE_CR_STRTUP_CNT_SHIFT;
  (void)AFE_CR_STRTUP_CNT(1);
  AFE_CR |= AFE_CR_STRTUP_CNT_MASK;
  AFE_CR &= ~(1U << AFE_CR_STRTUP_CNT_SHIFT);
  (void)AFE_CR_RESULT_FORMAT_MASK;
  (void)AFE_CR_RESULT_FORMAT_SHIFT;
  AFE_CR |= AFE_CR_RESULT_FORMAT_MASK;
  AFE_CR &= ~(1U << AFE_CR_RESULT_FORMAT_SHIFT);
  (void)AFE_CR_DLY_OK_MASK;
  (void)AFE_CR_DLY_OK_SHIFT;
  AFE_CR |= AFE_CR_DLY_OK_MASK;
  AFE_CR &= ~(1U << AFE_CR_DLY_OK_SHIFT);
  (void)AFE_CR_RST_B_MASK;
  (void)AFE_CR_RST_B_SHIFT;
  AFE_CR |= AFE_CR_RST_B_MASK;
  AFE_CR &= ~(1U << AFE_CR_RST_B_SHIFT);
  (void)AFE_CR_LPM_EN_MASK;
  (void)AFE_CR_LPM_EN_SHIFT;
  AFE_CR |= AFE_CR_LPM_EN_MASK;
  AFE_CR &= ~(1U << AFE_CR_LPM_EN_SHIFT);
  (void)AFE_CR_SOFT_TRG3_MASK;
  (void)AFE_CR_SOFT_TRG3_SHIFT;
  AFE_CR |= AFE_CR_SOFT_TRG3_MASK;
  AFE_CR &= ~(1U << AFE_CR_SOFT_TRG3_SHIFT);
  (void)AFE_CR_SOFT_TRG2_MASK;
  (void)AFE_CR_SOFT_TRG2_SHIFT;
  AFE_CR |= AFE_CR_SOFT_TRG2_MASK;
  AFE_CR &= ~(1U << AFE_CR_SOFT_TRG2_SHIFT);
  (void)AFE_CR_SOFT_TRG1_MASK;
  (void)AFE_CR_SOFT_TRG1_SHIFT;
  AFE_CR |= AFE_CR_SOFT_TRG1_MASK;
  AFE_CR &= ~(1U << AFE_CR_SOFT_TRG1_SHIFT);
  (void)AFE_CR_SOFT_TRG0_MASK;
  (void)AFE_CR_SOFT_TRG0_SHIFT;
  AFE_CR |= AFE_CR_SOFT_TRG0_MASK;
  AFE_CR &= ~(1U << AFE_CR_SOFT_TRG0_SHIFT);
  (void)AFE_CR_MSTR_EN_MASK;
  (void)AFE_CR_MSTR_EN_SHIFT;
  AFE_CR |= AFE_CR_MSTR_EN_MASK;
  AFE_CR &= ~(1U << AFE_CR_MSTR_EN_SHIFT);
  AFE_CKR_REG(AFE_BASE_PTR) = AFE_CKR_REG(AFE_BASE_PTR) + 1;
  (void)AFE_CKR_CLS_MASK;
  (void)AFE_CKR_CLS_SHIFT;
  (void)AFE_CKR_CLS(1);
  AFE_CKR |= AFE_CKR_CLS_MASK;
  AFE_CKR &= ~(1U << AFE_CKR_CLS_SHIFT);
  (void)AFE_CKR_DIV_MASK;
  (void)AFE_CKR_DIV_SHIFT;
  (void)AFE_CKR_DIV(1);
  AFE_CKR |= AFE_CKR_DIV_MASK;
  AFE_CKR &= ~(1U << AFE_CKR_DIV_SHIFT);
  AFE_DI_REG(AFE_BASE_PTR) = AFE_DI_REG(AFE_BASE_PTR) + 1;
  (void)AFE_DI_INTEN3_MASK;
  (void)AFE_DI_INTEN3_SHIFT;
  AFE_DI |= AFE_DI_INTEN3_MASK;
  AFE_DI &= ~(1U << AFE_DI_INTEN3_SHIFT);
  (void)AFE_DI_INTEN2_MASK;
  (void)AFE_DI_INTEN2_SHIFT;
  AFE_DI |= AFE_DI_INTEN2_MASK;
  AFE_DI &= ~(1U << AFE_DI_INTEN2_SHIFT);
  (void)AFE_DI_INTEN1_MASK;
  (void)AFE_DI_INTEN1_SHIFT;
  AFE_DI |= AFE_DI_INTEN1_MASK;
  AFE_DI &= ~(1U << AFE_DI_INTEN1_SHIFT);
  (void)AFE_DI_INTEN0_MASK;
  (void)AFE_DI_INTEN0_SHIFT;
  AFE_DI |= AFE_DI_INTEN0_MASK;
  AFE_DI &= ~(1U << AFE_DI_INTEN0_SHIFT);
  (void)AFE_DI_DMAEN3_MASK;
  (void)AFE_DI_DMAEN3_SHIFT;
  AFE_DI |= AFE_DI_DMAEN3_MASK;
  AFE_DI &= ~(1U << AFE_DI_DMAEN3_SHIFT);
  (void)AFE_DI_DMAEN2_MASK;
  (void)AFE_DI_DMAEN2_SHIFT;
  AFE_DI |= AFE_DI_DMAEN2_MASK;
  AFE_DI &= ~(1U << AFE_DI_DMAEN2_SHIFT);
  (void)AFE_DI_DMAEN1_MASK;
  (void)AFE_DI_DMAEN1_SHIFT;
  AFE_DI |= AFE_DI_DMAEN1_MASK;
  AFE_DI &= ~(1U << AFE_DI_DMAEN1_SHIFT);
  (void)AFE_DI_DMAEN0_MASK;
  (void)AFE_DI_DMAEN0_SHIFT;
  AFE_DI |= AFE_DI_DMAEN0_MASK;
  AFE_DI &= ~(1U << AFE_DI_DMAEN0_SHIFT);
  AFE_DR_REG(AFE_BASE_PTR,0) = AFE_DR_REG(AFE_BASE_PTR,0) + 1;
  AFE_DR(0) = AFE_DR(0) + 1;
  (void)AFE_DR_DLY_MASK;
  (void)AFE_DR_DLY_SHIFT;
  (void)AFE_DR_DLY(1);
  AFE_CH0_DR |= AFE_DR_DLY_MASK;
  AFE_CH0_DR &= ~(1U << AFE_DR_DLY_SHIFT);
  (void)AFE_RR_SDR_MASK;
  (void)AFE_RR_SDR_SHIFT;
  (void)AFE_RR_SDR(1);
  AFE_CH0_RR |= AFE_RR_SDR_MASK;
  AFE_CH0_RR &= ~(1U << AFE_RR_SDR_SHIFT);
  (void)AFE_RR_SIGN_BITS_MASK;
  (void)AFE_RR_SIGN_BITS_SHIFT;
  (void)AFE_RR_SIGN_BITS(1);
  AFE_CH0_RR |= AFE_RR_SIGN_BITS_MASK;
  AFE_CH0_RR &= ~(1U << AFE_RR_SIGN_BITS_SHIFT);
  (void)AFE_SR_RDY3_MASK;
  (void)AFE_SR_RDY3_SHIFT;
  AFE_SR |= AFE_SR_RDY3_MASK;
  AFE_SR &= ~(1U << AFE_SR_RDY3_SHIFT);
  (void)AFE_SR_RDY2_MASK;
  (void)AFE_SR_RDY2_SHIFT;
  AFE_SR |= AFE_SR_RDY2_MASK;
  AFE_SR &= ~(1U << AFE_SR_RDY2_SHIFT);
  (void)AFE_SR_RDY1_MASK;
  (void)AFE_SR_RDY1_SHIFT;
  AFE_SR |= AFE_SR_RDY1_MASK;
  AFE_SR &= ~(1U << AFE_SR_RDY1_SHIFT);
  (void)AFE_SR_RDY0_MASK;
  (void)AFE_SR_RDY0_SHIFT;
  AFE_SR |= AFE_SR_RDY0_MASK;
  AFE_SR &= ~(1U << AFE_SR_RDY0_SHIFT);
  (void)AFE_SR_OVR3_MASK;
  (void)AFE_SR_OVR3_SHIFT;
  AFE_SR |= AFE_SR_OVR3_MASK;
  AFE_SR &= ~(1U << AFE_SR_OVR3_SHIFT);
  (void)AFE_SR_OVR2_MASK;
  (void)AFE_SR_OVR2_SHIFT;
  AFE_SR |= AFE_SR_OVR2_MASK;
  AFE_SR &= ~(1U << AFE_SR_OVR2_SHIFT);
  (void)AFE_SR_OVR1_MASK;
  (void)AFE_SR_OVR1_SHIFT;
  AFE_SR |= AFE_SR_OVR1_MASK;
  AFE_SR &= ~(1U << AFE_SR_OVR1_SHIFT);
  (void)AFE_SR_OVR0_MASK;
  (void)AFE_SR_OVR0_SHIFT;
  AFE_SR |= AFE_SR_OVR0_MASK;
  AFE_SR &= ~(1U << AFE_SR_OVR0_SHIFT);
  (void)AFE_SR_COC3_MASK;
  (void)AFE_SR_COC3_SHIFT;
  AFE_SR |= AFE_SR_COC3_MASK;
  AFE_SR &= ~(1U << AFE_SR_COC3_SHIFT);
  (void)AFE_SR_COC2_MASK;
  (void)AFE_SR_COC2_SHIFT;
  AFE_SR |= AFE_SR_COC2_MASK;
  AFE_SR &= ~(1U << AFE_SR_COC2_SHIFT);
  (void)AFE_SR_COC1_MASK;
  (void)AFE_SR_COC1_SHIFT;
  AFE_SR |= AFE_SR_COC1_MASK;
  AFE_SR &= ~(1U << AFE_SR_COC1_SHIFT);
  (void)AFE_SR_COC0_MASK;
  (void)AFE_SR_COC0_SHIFT;
  AFE_SR |= AFE_SR_COC0_MASK;
  AFE_SR &= ~(1U << AFE_SR_COC0_SHIFT);
}

