kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO7_SHIFT);
  (void)AIPS_PACRL_AC6_MASK;
  (void)AIPS_PACRL_AC6_SHIFT;
  (void)AIPS_PACRL_AC6(1);
  AIPS_PACRL |= AIPS_PACRL_AC6_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC6_SHIFT);
  (void)AIPS_PACRL_RO6_MASK;
  (void)AIPS_PACRL_RO6_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO6_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO6_SHIFT);
  (void)AIPS_PACRL_AC5_MASK;
  (void)AIPS_PACRL_AC5_SHIFT;
  (void)AIPS_PACRL_AC5(1);
  AIPS_PACRL |= AIPS_PACRL_AC5_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC5_SHIFT);
  (void)AIPS_PACRL_RO5_MASK;
  (void)AIPS_PACRL_RO5_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO5_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO5_SHIFT);
  (void)AIPS_PACRL_AC4_MASK;
  (void)AIPS_PACRL_AC4_SHIFT;
  (void)AIPS_PACRL_AC4(1);
  AIPS_PACRL |= AIPS_PACRL_AC4_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC4_SHIFT);
  (void)AIPS_PACRL_RO4_MASK;
  (void)AIPS_PACRL_RO4_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO4_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO4_SHIFT);
  (void)AIPS_PACRL_AC3_MASK;
  (void)AIPS_PACRL_AC3_SHIFT;
  (void)AIPS_PACRL_AC3(1);
  AIPS_PACRL |= AIPS_PACRL_AC3_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC3_SHIFT);
  (void)AIPS_PACRL_RO3_MASK;
  (void)AIPS_PACRL_RO3_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO3_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO3_SHIFT);
  (void)AIPS_PACRL_AC2_MASK;
  (void)AIPS_PACRL_AC2_SHIFT;
  (void)AIPS_PACRL_AC2(1);
  AIPS_PACRL |= AIPS_PACRL_AC2_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC2_SHIFT);
  (void)AIPS_PACRL_RO2_MASK;
  (void)AIPS_PACRL_RO2_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO2_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO2_SHIFT);
  (void)AIPS_PACRL_AC1_MASK;
  (void)AIPS_PACRL_AC1_SHIFT;
  (void)AIPS_PACRL_AC1(1);
  AIPS_PACRL |= AIPS_PACRL_AC1_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC1_SHIFT);
  (void)AIPS_PACRL_RO1_MASK;
  (void)AIPS_PACRL_RO1_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO1_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO1_SHIFT);
  (void)AIPS_PACRL_AC0_MASK;
  (void)AIPS_PACRL_AC0_SHIFT;
  (void)AIPS_PACRL_AC0(1);
  AIPS_PACRL |= AIPS_PACRL_AC0_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC0_SHIFT);
  (void)AIPS_PACRL_RO0_MASK;
  (void)AIPS_PACRL_RO0_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO0_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO0_SHIFT);
  AIPS_PACRM_REG(AIPS_BASE_PTR) = AIPS_PACRM_REG(AIPS_BASE_PTR) + 1;
  (void)AIPS_PACRM_AC7_MASK;
  (void)AIPS_PACRM_AC7_SHIFT;
  (void)AIPS_PACRM_AC7(1);
  AIPS_PACRM |= AIPS_PACRM_AC7_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC7_SHIFT);
  (void)AIPS_PACRM_RO7_MASK;
  (void)AIPS_PACRM_RO7_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO7_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO7_SHIFT);
  (void)AIPS_PACRM_AC6_MASK;
  (void)AIPS_PACRM_AC6_SHIFT;
  (void)AIPS_PACRM_AC6(1);
  AIPS_PACRM |= AIPS_PACRM_AC6_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC6_SHIFT);
  (void)AIPS_PACRM_RO6_MASK;
  (void)AIPS_PACRM_RO6_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO6_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO6_SHIFT);
  (void)AIPS_PACRM_AC5_MASK;
  (void)AIPS_PACRM_AC5_SHIFT;
  (void)AIPS_PACRM_AC5(1);
  AIPS_PACRM |= AIPS_PACRM_AC5_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC5_SHIFT);
  (void)AIPS_PACRM_RO5_MASK;
  (void)AIPS_PACRM_RO5_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO5_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO5_SHIFT);
  (void)AIPS_PACRM_AC4_MASK;
  (void)AIPS_PACRM_AC4_SHIFT;
  (void)AIPS_PACRM_AC4(1);
  AIPS_PACRM |= AIPS_PACRM_AC4_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC4_SHIFT);
  (void)AIPS_PACRM_RO4_MASK;
  (void)AIPS_PACRM_RO4_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO4_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO4_SHIFT);
  (void)AIPS_PACRM_AC3_MASK;
  (void)AIPS_PACRM_AC3_SHIFT;
  (void)AIPS_PACRM_AC3(1);
  AIPS_PACRM |= AIPS_PACRM_AC3_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC3_SHIFT);
  (void)AIPS_PACRM_RO3_MASK;
  (void)AIPS_PACRM_RO3_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO3_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO3_SHIFT);
  (void)AIPS_PACRM_AC2_MASK;
  (void)AIPS_PACRM_AC2_SHIFT;
  (void)AIPS_PACRM_AC2(1);
  AIPS_PACRM |= AIPS_PACRM_AC2_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC2_SHIFT);
  (void)AIPS_PACRM_RO2_MASK;
  (void)AIPS_PACRM_RO2_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO2_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO2_SHIFT);
  (void)AIPS_PACRM_AC1_MASK;
  (void)AIPS_PACRM_AC1_SHIFT;
  (void)AIPS_PACRM_AC1(1);
  AIPS_PACRM |= AIPS_PACRM_AC1_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC1_SHIFT);
  (void)AIPS_PACRM_RO1_MASK;
  (void)AIPS_PACRM_RO1_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO1_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO1_SHIFT);
  (void)AIPS_PACRM_AC0_MASK;
  (void)AIPS_PACRM_AC0_SHIFT;
  (void)AIPS_PACRM_AC0(1);
  AIPS_PACRM |= AIPS_PACRM_AC0_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_AC0_SHIFT);
  (void)AIPS_PACRM_RO0_MASK;
  (void)AIPS_PACRM_RO0_SHIFT;
  AIPS_PACRM |= AIPS_PACRM_RO0_MASK;
  AIPS_PACRM &= ~(1U << AIPS_PACRM_RO0_SHIFT);
  AIPS_PACRN_REG(AIPS_BASE_PTR) = AIPS_PACRN_REG(AIPS_BASE_PTR) + 1;
  (void)AIPS_PACRN_AC7_MASK;
  (void)AIPS_PACRN_AC7_SHIFT;
  (void)AIPS_PACRN_AC7(1);
  AIPS_PACRN |= AIPS_PACRN_AC7_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC7_SHIFT);
  (void)AIPS_PACRN_RO7_MASK;
  (void)AIPS_PACRN_RO7_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO7_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO7_SHIFT);
  (void)AIPS_PACRN_AC6_MASK;
  (void)AIPS_PACRN_AC6_SHIFT;
  (void)AIPS_PACRN_AC6(1);
  AIPS_PACRN |= AIPS_PACRN_AC6_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC6_SHIFT);
  (void)AIPS_PACRN_RO6_MASK;
  (void)AIPS_PACRN_RO6_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO6_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO6_SHIFT);
  (void)AIPS_PACRN_AC5_MASK;
  (void)AIPS_PACRN_AC5_SHIFT;
  (void)AIPS_PACRN_AC5(1);
  AIPS_PACRN |= AIPS_PACRN_AC5_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC5_SHIFT);
  (void)AIPS_PACRN_RO5_MASK;
  (void)AIPS_PACRN_RO5_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO5_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO5_SHIFT);
  (void)AIPS_PACRN_AC4_MASK;
  (void)AIPS_PACRN_AC4_SHIFT;
  (void)AIPS_PACRN_AC4(1);
  AIPS_PACRN |= AIPS_PACRN_AC4_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC4_SHIFT);
  (void)AIPS_PACRN_RO4_MASK;
  (void)AIPS_PACRN_RO4_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO4_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO4_SHIFT);
  (void)AIPS_PACRN_AC3_MASK;
  (void)AIPS_PACRN_AC3_SHIFT;
  (void)AIPS_PACRN_AC3(1);
  AIPS_PACRN |= AIPS_PACRN_AC3_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC3_SHIFT);
  (void)AIPS_PACRN_RO3_MASK;
  (void)AIPS_PACRN_RO3_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO3_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO3_SHIFT);
  (void)AIPS_PACRN_AC2_MASK;
  (void)AIPS_PACRN_AC2_SHIFT;
  (void)AIPS_PACRN_AC2(1);
  AIPS_PACRN |= AIPS_PACRN_AC2_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC2_SHIFT);
  (void)AIPS_PACRN_RO2_MASK;
  (void)AIPS_PACRN_RO2_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO2_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO2_SHIFT);
  (void)AIPS_PACRN_AC1_MASK;
  (void)AIPS_PACRN_AC1_SHIFT;
  (void)AIPS_PACRN_AC1(1);
  AIPS_PACRN |= AIPS_PACRN_AC1_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC1_SHIFT);
  (void)AIPS_PACRN_RO1_MASK;
  (void)AIPS_PACRN_RO1_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO1_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO1_SHIFT);
  (void)AIPS_PACRN_AC0_MASK;
  (void)AIPS_PACRN_AC0_SHIFT;
  (void)AIPS_PACRN_AC0(1);
  AIPS_PACRN |= AIPS_PACRN_AC0_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_AC0_SHIFT);
  (void)AIPS_PACRN_RO0_MASK;
  (void)AIPS_PACRN_RO0_SHIFT;
  AIPS_PACRN |= AIPS_PACRN_RO0_MASK;
  AIPS_PACRN &= ~(1U << AIPS_PACRN_RO0_SHIFT);
  AIPS_PACRO_REG(AIPS_BASE_PTR) = AIPS_PACRO_REG(AIPS_BASE_PTR) + 1;
  (void)AIPS_PACRO_AC7_MASK;
  (void)AIPS_PACRO_AC7_SHIFT;
  (void)AIPS_PACRO_AC7(1);
  AIPS_PACRO |= AIPS_PACRO_AC7_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC7_SHIFT);
  (void)AIPS_PACRO_RO7_MASK;
  (void)AIPS_PACRO_RO7_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO7_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO7_SHIFT);
  (void)AIPS_PACRO_AC6_MASK;
  (void)AIPS_PACRO_AC6_SHIFT;
  (void)AIPS_PACRO_AC6(1);
  AIPS_PACRO |= AIPS_PACRO_AC6_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC6_SHIFT);
  (void)AIPS_PACRO_RO6_MASK;
  (void)AIPS_PACRO_RO6_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO6_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO6_SHIFT);
  (void)AIPS_PACRO_AC5_MASK;
  (void)AIPS_PACRO_AC5_SHIFT;
  (void)AIPS_PACRO_AC5(1);
  AIPS_PACRO |= AIPS_PACRO_AC5_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC5_SHIFT);
  (void)AIPS_PACRO_RO5_MASK;
  (void)AIPS_PACRO_RO5_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO5_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO5_SHIFT);
  (void)AIPS_PACRO_AC4_MASK;
  (void)AIPS_PACRO_AC4_SHIFT;
  (void)AIPS_PACRO_AC4(1);
  AIPS_PACRO |= AIPS_PACRO_AC4_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC4_SHIFT);
  (void)AIPS_PACRO_RO4_MASK;
  (void)AIPS_PACRO_RO4_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO4_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO4_SHIFT);
  (void)AIPS_PACRO_AC3_MASK;
  (void)AIPS_PACRO_AC3_SHIFT;
  (void)AIPS_PACRO_AC3(1);
  AIPS_PACRO |= AIPS_PACRO_AC3_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC3_SHIFT);
  (void)AIPS_PACRO_RO3_MASK;
  (void)AIPS_PACRO_RO3_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO3_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO3_SHIFT);
  (void)AIPS_PACRO_AC2_MASK;
  (void)AIPS_PACRO_AC2_SHIFT;
  (void)AIPS_PACRO_AC2(1);
  AIPS_PACRO |= AIPS_PACRO_AC2_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC2_SHIFT);
  (void)AIPS_PACRO_RO2_MASK;
  (void)AIPS_PACRO_RO2_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO2_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO2_SHIFT);
  (void)AIPS_PACRO_AC1_MASK;
  (void)AIPS_PACRO_AC1_SHIFT;
  (void)AIPS_PACRO_AC1(1);
  AIPS_PACRO |= AIPS_PACRO_AC1_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC1_SHIFT);
  (void)AIPS_PACRO_RO1_MASK;
  (void)AIPS_PACRO_RO1_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO1_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO1_SHIFT);
  (void)AIPS_PACRO_AC0_MASK;
  (void)AIPS_PACRO_AC0_SHIFT;
  (void)AIPS_PACRO_AC0(1);
  AIPS_PACRO |= AIPS_PACRO_AC0_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_AC0_SHIFT);
  (void)AIPS_PACRO_RO0_MASK;
  (void)AIPS_PACRO_RO0_SHIFT;
  AIPS_PACRO |= AIPS_PACRO_RO0_MASK;
  AIPS_PACRO &= ~(1U << AIPS_PACRO_RO0_SHIFT);
  AIPS_PACRP_REG(AIPS_BASE_PTR) = AIPS_PACRP_REG(AIPS_BASE_PTR) + 1;
  (void)AIPS_PACRP_AC7_MASK;
  (void)AIPS_PACRP_AC7_SHIFT;
  (void)AIPS_PACRP_AC7(1);
  AIPS_PACRP |= AIPS_PACRP_AC7_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC7_SHIFT);
  (void)AIPS_PACRP_RO7_MASK;
  (void)AIPS_PACRP_RO7_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO7_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO7_SHIFT);
  (void)AIPS_PACRP_AC6_MASK;
  (void)AIPS_PACRP_AC6_SHIFT;
  (void)AIPS_PACRP_AC6(1);
  AIPS_PACRP |= AIPS_PACRP_AC6_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC6_SHIFT);
  (void)AIPS_PACRP_RO6_MASK;
  (void)AIPS_PACRP_RO6_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO6_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO6_SHIFT);
  (void)AIPS_PACRP_AC5_MASK;
  (void)AIPS_PACRP_AC5_SHIFT;
  (void)AIPS_PACRP_AC5(1);
  AIPS_PACRP |= AIPS_PACRP_AC5_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC5_SHIFT);
  (void)AIPS_PACRP_RO5_MASK;
  (void)AIPS_PACRP_RO5_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO5_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO5_SHIFT);
  (void)AIPS_PACRP_AC4_MASK;
  (void)AIPS_PACRP_AC4_SHIFT;
  (void)AIPS_PACRP_AC4(1);
  AIPS_PACRP |= AIPS_PACRP_AC4_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC4_SHIFT);
  (void)AIPS_PACRP_RO4_MASK;
  (void)AIPS_PACRP_RO4_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO4_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO4_SHIFT);
  (void)AIPS_PACRP_AC3_MASK;
  (void)AIPS_PACRP_AC3_SHIFT;
  (void)AIPS_PACRP_AC3(1);
  AIPS_PACRP |= AIPS_PACRP_AC3_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC3_SHIFT);
  (void)AIPS_PACRP_RO3_MASK;
  (void)AIPS_PACRP_RO3_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO3_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO3_SHIFT);
  (void)AIPS_PACRP_AC2_MASK;
  (void)AIPS_PACRP_AC2_SHIFT;
  (void)AIPS_PACRP_AC2(1);
  AIPS_PACRP |= AIPS_PACRP_AC2_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC2_SHIFT);
  (void)AIPS_PACRP_RO2_MASK;
  (void)AIPS_PACRP_RO2_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO2_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO2_SHIFT);
  (void)AIPS_PACRP_AC1_MASK;
  (void)AIPS_PACRP_AC1_SHIFT;
  (void)AIPS_PACRP_AC1(1);
  AIPS_PACRP |= AIPS_PACRP_AC1_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC1_SHIFT);
  (void)AIPS_PACRP_RO1_MASK;
  (void)AIPS_PACRP_RO1_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO1_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO1_SHIFT);
  (void)AIPS_PACRP_AC0_MASK;
  (void)AIPS_PACRP_AC0_SHIFT;
  (void)AIPS_PACRP_AC0(1);
  AIPS_PACRP |= AIPS_PACRP_AC0_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_AC0_SHIFT);
  (void)AIPS_PACRP_RO0_MASK;
  (void)AIPS_PACRP_RO0_SHIFT;
  AIPS_PACRP |= AIPS_PACRP_RO0_MASK;
  AIPS_PACRP &= ~(1U << AIPS_PACRP_RO0_SHIFT);
}

