kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
void test_BP(void) {
  (void)BP_BASE_PTR;
  BP_CTRL = BP_CTRL + 1;
  BP_COMP0 = BP_COMP0 + 1;
  BP_COMP1 = BP_COMP1 + 1;
  BP_CTRL_REG(BP_BASE_PTR) = BP_CTRL_REG(BP_BASE_PTR) + 1;
  BP_COMP_REG(BP_BASE_PTR,0) = BP_COMP_REG(BP_BASE_PTR,0) + 1;
  BP_COMP(0) = BP_COMP(0) + 1;
}

void test_CMP(void) {
  (void)CMP0_BASE_PTR;
  (void)CMP1_BASE_PTR;
  CMP0_CR0 = CMP0_CR0 + 1;
  CMP0_CR1 = CMP0_CR1 + 1;
  CMP0_FPR = CMP0_FPR + 1;
  CMP0_SCR = CMP0_SCR + 1;
  CMP0_DACCR = CMP0_DACCR + 1;
  CMP0_MUXCR = CMP0_MUXCR + 1;
  CMP1_CR0 = CMP1_CR0 + 1;
  CMP1_CR1 = CMP1_CR1 + 1;
  CMP1_FPR = CMP1_FPR + 1;
  CMP1_SCR = CMP1_SCR + 1;
  CMP1_DACCR = CMP1_DACCR + 1;
  CMP1_MUXCR = CMP1_MUXCR + 1;
  CMP_CR0_REG(CMP0_BASE_PTR) = CMP_CR0_REG(CMP0_BASE_PTR) + 1;
  CMP_CR0_REG(CMP1_BASE_PTR) = CMP_CR0_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_CR0_HYSTCTR_MASK;
  (void)CMP_CR0_HYSTCTR_SHIFT;
  (void)CMP_CR0_HYSTCTR(1);
  CMP0_CR0 |= CMP_CR0_HYSTCTR_MASK;
  CMP0_CR0 &= ~(1U << CMP_CR0_HYSTCTR_SHIFT);
  (void)CMP_CR0_FILTER_CNT_MASK;
  (void)CMP_CR0_FILTER_CNT_SHIFT;
  (void)CMP_CR0_FILTER_CNT(1);
  CMP0_CR0 |= CMP_CR0_FILTER_CNT_MASK;
  CMP0_CR0 &= ~(1U << CMP_CR0_FILTER_CNT_SHIFT);
  CMP_CR1_REG(CMP0_BASE_PTR) = CMP_CR1_REG(CMP0_BASE_PTR) + 1;
  CMP_CR1_REG(CMP1_BASE_PTR) = CMP_CR1_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_CR1_EN_MASK;
  (void)CMP_CR1_EN_SHIFT;
  CMP0_CR1 |= CMP_CR1_EN_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_EN_SHIFT);
  (void)CMP_CR1_OPE_MASK;
  (void)CMP_CR1_OPE_SHIFT;
  CMP0_CR1 |= CMP_CR1_OPE_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_OPE_SHIFT);
  (void)CMP_CR1_COS_MASK;
  (void)CMP_CR1_COS_SHIFT;
  CMP0_CR1 |= CMP_CR1_COS_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_COS_SHIFT);
  (void)CMP_CR1_INV_MASK;
  (void)CMP_CR1_INV_SHIFT;
  CMP0_CR1 |= CMP_CR1_INV_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_INV_SHIFT);
  (void)CMP_CR1_PMODE_MASK;
  (void)CMP_CR1_PMODE_SHIFT;
  CMP0_CR1 |= CMP_CR1_PMODE_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_PMODE_SHIFT);
  (void)CMP_CR1_TRIGM_MASK;
  (void)CMP_CR1_TRIGM_SHIFT;
  CMP0_CR1 |= CMP_CR1_TRIGM_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_TRIGM_SHIFT);
  (void)CMP_CR1_WE_MASK;
  (void)CMP_CR1_WE_SHIFT;
  CMP0_CR1 |= CMP_CR1_WE_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_WE_SHIFT);
  (void)CMP_CR1_SE_MASK;
  (void)CMP_CR1_SE_SHIFT;
  CMP0_CR1 |= CMP_CR1_SE_MASK;
  CMP0_CR1 &= ~(1U << CMP_CR1_SE_SHIFT);
  CMP_FPR_REG(CMP0_BASE_PTR) = CMP_FPR_REG(CMP0_BASE_PTR) + 1;
  CMP_FPR_REG(CMP1_BASE_PTR) = CMP_FPR_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_FPR_FILT_PER_MASK;
  (void)CMP_FPR_FILT_PER_SHIFT;
  (void)CMP_FPR_FILT_PER(1);
  CMP0_FPR |= CMP_FPR_FILT_PER_MASK;
  CMP0_FPR &= ~(1U << CMP_FPR_FILT_PER_SHIFT);
  CMP_SCR_REG(CMP0_BASE_PTR) = CMP_SCR_REG(CMP0_BASE_PTR) + 1;
  CMP_SCR_REG(CMP1_BASE_PTR) = CMP_SCR_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_SCR_COUT_MASK;
  (void)CMP_SCR_COUT_SHIFT;
  CMP0_SCR |= CMP_SCR_COUT_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_COUT_SHIFT);
  (void)CMP_SCR_CFF_MASK;
  (void)CMP_SCR_CFF_SHIFT;
  CMP0_SCR |= CMP_SCR_CFF_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_CFF_SHIFT);
  (void)CMP_SCR_CFR_MASK;
  (void)CMP_SCR_CFR_SHIFT;
  CMP0_SCR |= CMP_SCR_CFR_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_CFR_SHIFT);
  (void)CMP_SCR_IEF_MASK;
  (void)CMP_SCR_IEF_SHIFT;
  CMP0_SCR |= CMP_SCR_IEF_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_IEF_SHIFT);
  (void)CMP_SCR_IER_MASK;
  (void)CMP_SCR_IER_SHIFT;
  CMP0_SCR |= CMP_SCR_IER_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_IER_SHIFT);
  (void)CMP_SCR_DMAEN_MASK;
  (void)CMP_SCR_DMAEN_SHIFT;
  CMP0_SCR |= CMP_SCR_DMAEN_MASK;
  CMP0_SCR &= ~(1U << CMP_SCR_DMAEN_SHIFT);
  CMP_DACCR_REG(CMP0_BASE_PTR) = CMP_DACCR_REG(CMP0_BASE_PTR) + 1;
  CMP_DACCR_REG(CMP1_BASE_PTR) = CMP_DACCR_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_DACCR_VOSEL_MASK;
  (void)CMP_DACCR_VOSEL_SHIFT;
  (void)CMP_DACCR_VOSEL(1);
  CMP0_DACCR |= CMP_DACCR_VOSEL_MASK;
  CMP0_DACCR &= ~(1U << CMP_DACCR_VOSEL_SHIFT);
  (void)CMP_DACCR_VRSEL_MASK;
  (void)CMP_DACCR_VRSEL_SHIFT;
  CMP0_DACCR |= CMP_DACCR_VRSEL_MASK;
  CMP0_DACCR &= ~(1U << CMP_DACCR_VRSEL_SHIFT);
  (void)CMP_DACCR_DACEN_MASK;
  (void)CMP_DACCR_DACEN_SHIFT;
  CMP0_DACCR |= CMP_DACCR_DACEN_MASK;
  CMP0_DACCR &= ~(1U << CMP_DACCR_DACEN_SHIFT);
  CMP_MUXCR_REG(CMP0_BASE_PTR) = CMP_MUXCR_REG(CMP0_BASE_PTR) + 1;
  CMP_MUXCR_REG(CMP1_BASE_PTR) = CMP_MUXCR_REG(CMP1_BASE_PTR) + 1;
  (void)CMP_MUXCR_MSEL_MASK;
  (void)CMP_MUXCR_MSEL_SHIFT;
  (void)CMP_MUXCR_MSEL(1);
  CMP0_MUXCR |= CMP_MUXCR_MSEL_MASK;
  CMP0_MUXCR &= ~(1U << CMP_MUXCR_MSEL_SHIFT);
  (void)CMP_MUXCR_PSEL_MASK;
  (void)CMP_MUXCR_PSEL_SHIFT;
  (void)CMP_MUXCR_PSEL(1);
  CMP0_MUXCR |= CMP_MUXCR_PSEL_MASK;
  CMP0_MUXCR &= ~(1U << CMP_MUXCR_PSEL_SHIFT);
}

void test_CRC(void) {
  (void)CRC_BASE_PTR;
  CRC_DATA = CRC_DATA + 1;
  CRC_DATAL = CRC_DATAL + 1;
  CRC_DATALL = CRC_DATALL + 1;
  CRC_DATALU = CRC_DATALU + 1;
  CRC_DATAH = CRC_DATAH + 1;
  CRC_DATAHL = CRC_DATAHL + 1;
  CRC_DATAHU = CRC_DATAHU + 1;
  CRC_GPOLY = CRC_GPOLY + 1;
  CRC_GPOLYL = CRC_GPOLYL + 1;
  CRC_GPOLYLL = CRC_GPOLYLL + 1;
  CRC_GPOLYLU = CRC_GPOLYLU + 1;
  CRC_GPOLYH = CRC_GPOLYH + 1;
  CRC_GPOLYHL = CRC_GPOLYHL + 1;
  CRC_GPOLYHU = CRC_GPOLYHU + 1;
  CRC_CTRL = CRC_CTRL + 1;
  CRC_CTRLHU = CRC_CTRLHU + 1;
  CRC_DATAL_REG(CRC_BASE_PTR) = CRC_DATAL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATAL_DATAL_MASK;
  (void)CRC_DATAL_DATAL_SHIFT;
  (void)CRC_DATAL_DATAL(1);
  CRC_DATAL |= CRC_DATAL_DATAL_MASK;
  CRC_DATAL &= ~(1U << CRC_DATAL_DATAL_SHIFT);
  CRC_DATAH_REG(CRC_BASE_PTR) = CRC_DATAH_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATAH_DATAH_MASK;
  (void)CRC_DATAH_DATAH_SHIFT;
  (void)CRC_DATAH_DATAH(1);
  CRC_DATAH |= CRC_DATAH_DATAH_MASK;
  CRC_DATAH &= ~(1U << CRC_DATAH_DATAH_SHIFT);
  CRC_DATA_REG(CRC_BASE_PTR) = CRC_DATA_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATA_LL_MASK;
  (void)CRC_DATA_LL_SHIFT;
  (void)CRC_DATA_LL(1);
  CRC_DATA |= CRC_DATA_LL_MASK;
  CRC_DATA &= ~(1U << CRC_DATA_LL_SHIFT);
  (void)CRC_DATA_LU_MASK;
  (void)CRC_DATA_LU_SHIFT;
  (void)CRC_DATA_LU(1);
  CRC_DATA |= CRC_DATA_LU_MASK;
  CRC_DATA &= ~(1U << CRC_DATA_LU_SHIFT);
  (void)CRC_DATA_HL_MASK;
  (void)CRC_DATA_HL_SHIFT;
  (void)CRC_DATA_HL(1);
  CRC_DATA |= CRC_DATA_HL_MASK;
  CRC_DATA &= ~(1U << CRC_DATA_HL_SHIFT);
  (void)CRC_DATA_HU_MASK;
  (void)CRC_DATA_HU_SHIFT;
  (void)CRC_DATA_HU(1);
  CRC_DATA |= CRC_DATA_HU_MASK;
  CRC_DATA &= ~(1U << CRC_DATA_HU_SHIFT);
  CRC_DATALL_REG(CRC_BASE_PTR) = CRC_DATALL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATALL_DATALL_MASK;
  (void)CRC_DATALL_DATALL_SHIFT;
  (void)CRC_DATALL_DATALL(1);
  CRC_DATALL |= CRC_DATALL_DATALL_MASK;
  CRC_DATALL &= ~(1U << CRC_DATALL_DATALL_SHIFT);
  CRC_DATALU_REG(CRC_BASE_PTR) = CRC_DATALU_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATALU_DATALU_MASK;
  (void)CRC_DATALU_DATALU_SHIFT;
  (void)CRC_DATALU_DATALU(1);
  CRC_DATALU |= CRC_DATALU_DATALU_MASK;
  CRC_DATALU &= ~(1U << CRC_DATALU_DATALU_SHIFT);
  CRC_DATAHL_REG(CRC_BASE_PTR) = CRC_DATAHL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATAHL_DATAHL_MASK;
  (void)CRC_DATAHL_DATAHL_SHIFT;
  (void)CRC_DATAHL_DATAHL(1);
  CRC_DATAHL |= CRC_DATAHL_DATAHL_MASK;
  CRC_DATAHL &= ~(1U << CRC_DATAHL_DATAHL_SHIFT);
  CRC_DATAHU_REG(CRC_BASE_PTR) = CRC_DATAHU_REG(CRC_BASE_PTR) + 1;
  (void)CRC_DATAHU_DATAHU_MASK;
  (void)CRC_DATAHU_DATAHU_SHIFT;
  (void)CRC_DATAHU_DATAHU(1);
  CRC_DATAHU |= CRC_DATAHU_DATAHU_MASK;
  CRC_DATAHU &= ~(1U << CRC_DATAHU_DATAHU_SHIFT);
  CRC_GPOLYL_REG(CRC_BASE_PTR) = CRC_GPOLYL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYL_GPOLYL_MASK;
  (void)CRC_GPOLYL_GPOLYL_SHIFT;
  (void)CRC_GPOLYL_GPOLYL(1);
  CRC_GPOLYL |= CRC_GPOLYL_GPOLYL_MASK;
  CRC_GPOLYL &= ~(1U << CRC_GPOLYL_GPOLYL_SHIFT);
  CRC_GPOLYH_REG(CRC_BASE_PTR) = CRC_GPOLYH_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYH_GPOLYH_MASK;
  (void)CRC_GPOLYH_GPOLYH_SHIFT;
  (void)CRC_GPOLYH_GPOLYH(1);
  CRC_GPOLYH |= CRC_GPOLYH_GPOLYH_MASK;
  CRC_GPOLYH &= ~(1U << CRC_GPOLYH_GPOLYH_SHIFT);
  CRC_GPOLY_REG(CRC_BASE_PTR) = CRC_GPOLY_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLY_LOW_MASK;
  (void)CRC_GPOLY_LOW_SHIFT;
  (void)CRC_GPOLY_LOW(1);
  CRC_GPOLY |= CRC_GPOLY_LOW_MASK;
  CRC_GPOLY &= ~(1U << CRC_GPOLY_LOW_SHIFT);
  (void)CRC_GPOLY_HIGH_MASK;
  (void)CRC_GPOLY_HIGH_SHIFT;
  (void)CRC_GPOLY_HIGH(1);
  CRC_GPOLY |= CRC_GPOLY_HIGH_MASK;
  CRC_GPOLY &= ~(1U << CRC_GPOLY_HIGH_SHIFT);
  CRC_GPOLYLL_REG(CRC_BASE_PTR) = CRC_GPOLYLL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYLL_GPOLYLL_MASK;
  (void)CRC_GPOLYLL_GPOLYLL_SHIFT;
  (void)CRC_GPOLYLL_GPOLYLL(1);
  CRC_GPOLYLL |= CRC_GPOLYLL_GPOLYLL_MASK;
  CRC_GPOLYLL &= ~(1U << CRC_GPOLYLL_GPOLYLL_SHIFT);
  CRC_GPOLYLU_REG(CRC_BASE_PTR) = CRC_GPOLYLU_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYLU_GPOLYLU_MASK;
  (void)CRC_GPOLYLU_GPOLYLU_SHIFT;
  (void)CRC_GPOLYLU_GPOLYLU(1);
  CRC_GPOLYLU |= CRC_GPOLYLU_GPOLYLU_MASK;
  CRC_GPOLYLU &= ~(1U << CRC_GPOLYLU_GPOLYLU_SHIFT);
  CRC_GPOLYHL_REG(CRC_BASE_PTR) = CRC_GPOLYHL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYHL_GPOLYHL_MASK;
  (void)CRC_GPOLYHL_GPOLYHL_SHIFT;
  (void)CRC_GPOLYHL_GPOLYHL(1);
  CRC_GPOLYHL |= CRC_GPOLYHL_GPOLYHL_MASK;
  CRC_GPOLYHL &= ~(1U << CRC_GPOLYHL_GPOLYHL_SHIFT);
  CRC_GPOLYHU_REG(CRC_BASE_PTR) = CRC_GPOLYHU_REG(CRC_BASE_PTR) + 1;
  (void)CRC_GPOLYHU_GPOLYHU_MASK;
  (void)CRC_GPOLYHU_GPOLYHU_SHIFT;
  (void)CRC_GPOLYHU_GPOLYHU(1);
  CRC_GPOLYHU |= CRC_GPOLYHU_GPOLYHU_MASK;
  CRC_GPOLYHU &= ~(1U << CRC_GPOLYHU_GPOLYHU_SHIFT);
  CRC_CTRL_REG(CRC_BASE_PTR) = CRC_CTRL_REG(CRC_BASE_PTR) + 1;
  (void)CRC_CTRL_TCRC_MASK;
  (void)CRC_CTRL_TCRC_SHIFT;
  CRC_CTRL |= CRC_CTRL_TCRC_MASK;
  CRC_CTRL &= ~(1U << CRC_CTRL_TCRC_SHIFT);
  (void)CRC_CTRL_WAS_MASK;
  (void)CRC_CTRL_WAS_SHIFT;
  CRC_CTRL |= CRC_CTRL_WAS_MASK;
  CRC_CTRL &= ~(1U << CRC_CTRL_WAS_SHIFT);
  (void)CRC_CTRL_FXOR_MASK;
  (void)CRC_CTRL_FXOR_SHIFT;
  CRC_CTRL |= CRC_CTRL_FXOR_MASK;
  CRC_CTRL &= ~(1U << CRC_CTRL_FXOR_SHIFT);
  (void)CRC_CTRL_TOTR_MASK;
  (void)CRC_CTRL_TOTR_SHIFT;
  (void)CRC_CTRL_TOTR(1);
  CRC_CTRL |= CRC_CTRL_TOTR_MASK;
  CRC_CTRL &= ~(1U << CRC_CTRL_TOTR_SHIFT);
  (void)CRC_CTRL_TOT_MASK;
  (void)CRC_CTRL_TOT_SHIFT;
  (void)CRC_CTRL_TOT(1);
  CRC_CTRL |= CRC_CTRL_TOT_MASK;
  CRC_CTRL &= ~(1U << CRC_CTRL_TOT_SHIFT);
  CRC_CTRLHU_REG(CRC_BASE_PTR) = CRC_CTRLHU_REG(CRC_BASE_PTR) + 1;
  (void)CRC_CTRLHU_TCRC_MASK;
  (void)CRC_CTRLHU_TCRC_SHIFT;
  CRC_CTRLHU |= CRC_CTRLHU_TCRC_MASK;
  CRC_CTRLHU &= ~(1U << CRC_CTRLHU_TCRC_SHIFT);
  (void)CRC_CTRLHU_WAS_MASK;
  (void)CRC_CTRLHU_WAS_SHIFT;
  CRC_CTRLHU |= CRC_CTRLHU_WAS_MASK;
  CRC_CTRLHU &= ~(1U << CRC_CTRLHU_WAS_SHIFT);
  (void)CRC_CTRLHU_FXOR_MASK;
  (void)CRC_CTRLHU_FXOR_SHIFT;
  CRC_CTRLHU |= CRC_CTRLHU_FXOR_MASK;
  CRC_CTRLHU &= ~(1U << CRC_CTRLHU_FXOR_SHIFT);
  (void)CRC_CTRLHU_TOTR_MASK;
  (void)CRC_CTRLHU_TOTR_SHIFT;
  (void)CRC_CTRLHU_TOTR(1);
  CRC_CTRLHU |= CRC_CTRLHU_TOTR_MASK;
  CRC_CTRLHU &= ~(1U << CRC_CTRLHU_TOTR_SHIFT);
  (void)CRC_CTRLHU_TOT_MASK;
  (void)CRC_CTRLHU_TOT_SHIFT;
  (void)CRC_CTRLHU_TOT(1);
  CRC_CTRLHU |= CRC_CTRLHU_TOT_MASK;
  CRC_CTRLHU &= ~(1U << CRC_CTRLHU_TOT_SHIFT);
}

