kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD24_SHIFT);
  (void)LCD_WF8B_BPALCD23_MASK;
  (void)LCD_WF8B_BPALCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD23_SHIFT);
  (void)LCD_WF8B_BPALCD22_MASK;
  (void)LCD_WF8B_BPALCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD22_SHIFT);
  (void)LCD_WF8B_BPALCD6_MASK;
  (void)LCD_WF8B_BPALCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD6_SHIFT);
  (void)LCD_WF8B_BPALCD21_MASK;
  (void)LCD_WF8B_BPALCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD21_SHIFT);
  (void)LCD_WF8B_BPALCD20_MASK;
  (void)LCD_WF8B_BPALCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD20_SHIFT);
  (void)LCD_WF8B_BPALCD19_MASK;
  (void)LCD_WF8B_BPALCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD19_SHIFT);
  (void)LCD_WF8B_BPALCD18_MASK;
  (void)LCD_WF8B_BPALCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD18_SHIFT);
  (void)LCD_WF8B_BPALCD17_MASK;
  (void)LCD_WF8B_BPALCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD17_SHIFT);
  (void)LCD_WF8B_BPALCD16_MASK;
  (void)LCD_WF8B_BPALCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD16_SHIFT);
  (void)LCD_WF8B_BPALCD15_MASK;
  (void)LCD_WF8B_BPALCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD15_SHIFT);
  (void)LCD_WF8B_BPALCD7_MASK;
  (void)LCD_WF8B_BPALCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD7_SHIFT);
  (void)LCD_WF8B_BPALCD14_MASK;
  (void)LCD_WF8B_BPALCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD14_SHIFT);
  (void)LCD_WF8B_BPALCD13_MASK;
  (void)LCD_WF8B_BPALCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD13_SHIFT);
  (void)LCD_WF8B_BPALCD12_MASK;
  (void)LCD_WF8B_BPALCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD12_SHIFT);
  (void)LCD_WF8B_BPALCD11_MASK;
  (void)LCD_WF8B_BPALCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD11_SHIFT);
  (void)LCD_WF8B_BPALCD10_MASK;
  (void)LCD_WF8B_BPALCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD10_SHIFT);
  (void)LCD_WF8B_BPALCD9_MASK;
  (void)LCD_WF8B_BPALCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD9_SHIFT);
  (void)LCD_WF8B_BPALCD8_MASK;
  (void)LCD_WF8B_BPALCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPALCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPALCD8_SHIFT);
  (void)LCD_WF8B_BPBLCD1_MASK;
  (void)LCD_WF8B_BPBLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD1_SHIFT);
  (void)LCD_WF8B_BPBLCD32_MASK;
  (void)LCD_WF8B_BPBLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD32_SHIFT);
  (void)LCD_WF8B_BPBLCD30_MASK;
  (void)LCD_WF8B_BPBLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD30_SHIFT);
  (void)LCD_WF8B_BPBLCD60_MASK;
  (void)LCD_WF8B_BPBLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD60_SHIFT);
  (void)LCD_WF8B_BPBLCD24_MASK;
  (void)LCD_WF8B_BPBLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD24_SHIFT);
  (void)LCD_WF8B_BPBLCD28_MASK;
  (void)LCD_WF8B_BPBLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD28_SHIFT);
  (void)LCD_WF8B_BPBLCD23_MASK;
  (void)LCD_WF8B_BPBLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD23_SHIFT);
  (void)LCD_WF8B_BPBLCD48_MASK;
  (void)LCD_WF8B_BPBLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD48_SHIFT);
  (void)LCD_WF8B_BPBLCD10_MASK;
  (void)LCD_WF8B_BPBLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD10_SHIFT);
  (void)LCD_WF8B_BPBLCD15_MASK;
  (void)LCD_WF8B_BPBLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD15_SHIFT);
  (void)LCD_WF8B_BPBLCD36_MASK;
  (void)LCD_WF8B_BPBLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD36_SHIFT);
  (void)LCD_WF8B_BPBLCD44_MASK;
  (void)LCD_WF8B_BPBLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD44_SHIFT);
  (void)LCD_WF8B_BPBLCD62_MASK;
  (void)LCD_WF8B_BPBLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD62_SHIFT);
  (void)LCD_WF8B_BPBLCD53_MASK;
  (void)LCD_WF8B_BPBLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD53_SHIFT);
  (void)LCD_WF8B_BPBLCD22_MASK;
  (void)LCD_WF8B_BPBLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD22_SHIFT);
  (void)LCD_WF8B_BPBLCD47_MASK;
  (void)LCD_WF8B_BPBLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD47_SHIFT);
  (void)LCD_WF8B_BPBLCD33_MASK;
  (void)LCD_WF8B_BPBLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD33_SHIFT);
  (void)LCD_WF8B_BPBLCD2_MASK;
  (void)LCD_WF8B_BPBLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD2_SHIFT);
  (void)LCD_WF8B_BPBLCD49_MASK;
  (void)LCD_WF8B_BPBLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD49_SHIFT);
  (void)LCD_WF8B_BPBLCD0_MASK;
  (void)LCD_WF8B_BPBLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD0_SHIFT);
  (void)LCD_WF8B_BPBLCD55_MASK;
  (void)LCD_WF8B_BPBLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD55_SHIFT);
  (void)LCD_WF8B_BPBLCD56_MASK;
  (void)LCD_WF8B_BPBLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD56_SHIFT);
  (void)LCD_WF8B_BPBLCD21_MASK;
  (void)LCD_WF8B_BPBLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD21_SHIFT);
  (void)LCD_WF8B_BPBLCD6_MASK;
  (void)LCD_WF8B_BPBLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD6_SHIFT);
  (void)LCD_WF8B_BPBLCD29_MASK;
  (void)LCD_WF8B_BPBLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD29_SHIFT);
  (void)LCD_WF8B_BPBLCD25_MASK;
  (void)LCD_WF8B_BPBLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD25_SHIFT);
  (void)LCD_WF8B_BPBLCD8_MASK;
  (void)LCD_WF8B_BPBLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD8_SHIFT);
  (void)LCD_WF8B_BPBLCD54_MASK;
  (void)LCD_WF8B_BPBLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD54_SHIFT);
  (void)LCD_WF8B_BPBLCD38_MASK;
  (void)LCD_WF8B_BPBLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD38_SHIFT);
  (void)LCD_WF8B_BPBLCD43_MASK;
  (void)LCD_WF8B_BPBLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD43_SHIFT);
  (void)LCD_WF8B_BPBLCD20_MASK;
  (void)LCD_WF8B_BPBLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD20_SHIFT);
  (void)LCD_WF8B_BPBLCD9_MASK;
  (void)LCD_WF8B_BPBLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD9_SHIFT);
  (void)LCD_WF8B_BPBLCD7_MASK;
  (void)LCD_WF8B_BPBLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD7_SHIFT);
  (void)LCD_WF8B_BPBLCD50_MASK;
  (void)LCD_WF8B_BPBLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD50_SHIFT);
  (void)LCD_WF8B_BPBLCD40_MASK;
  (void)LCD_WF8B_BPBLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD40_SHIFT);
  (void)LCD_WF8B_BPBLCD63_MASK;
  (void)LCD_WF8B_BPBLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD63_SHIFT);
  (void)LCD_WF8B_BPBLCD26_MASK;
  (void)LCD_WF8B_BPBLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD26_SHIFT);
  (void)LCD_WF8B_BPBLCD12_MASK;
  (void)LCD_WF8B_BPBLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD12_SHIFT);
  (void)LCD_WF8B_BPBLCD19_MASK;
  (void)LCD_WF8B_BPBLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD19_SHIFT);
  (void)LCD_WF8B_BPBLCD34_MASK;
  (void)LCD_WF8B_BPBLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD34_SHIFT);
  (void)LCD_WF8B_BPBLCD39_MASK;
  (void)LCD_WF8B_BPBLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD39_SHIFT);
  (void)LCD_WF8B_BPBLCD59_MASK;
  (void)LCD_WF8B_BPBLCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD59_SHIFT);
  (void)LCD_WF8B_BPBLCD61_MASK;
  (void)LCD_WF8B_BPBLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD61_SHIFT);
  (void)LCD_WF8B_BPBLCD37_MASK;
  (void)LCD_WF8B_BPBLCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD37_SHIFT);
  (void)LCD_WF8B_BPBLCD31_MASK;
  (void)LCD_WF8B_BPBLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD31_SHIFT);
  (void)LCD_WF8B_BPBLCD58_MASK;
  (void)LCD_WF8B_BPBLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD58_SHIFT);
  (void)LCD_WF8B_BPBLCD18_MASK;
  (void)LCD_WF8B_BPBLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD18_SHIFT);
  (void)LCD_WF8B_BPBLCD45_MASK;
  (void)LCD_WF8B_BPBLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD45_SHIFT);
  (void)LCD_WF8B_BPBLCD27_MASK;
  (void)LCD_WF8B_BPBLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD27_SHIFT);
  (void)LCD_WF8B_BPBLCD14_MASK;
  (void)LCD_WF8B_BPBLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD14_SHIFT);
  (void)LCD_WF8B_BPBLCD51_MASK;
  (void)LCD_WF8B_BPBLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD51_SHIFT);
  (void)LCD_WF8B_BPBLCD52_MASK;
  (void)LCD_WF8B_BPBLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD52_SHIFT);
  (void)LCD_WF8B_BPBLCD4_MASK;
  (void)LCD_WF8B_BPBLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD4_SHIFT);
  (void)LCD_WF8B_BPBLCD35_MASK;
  (void)LCD_WF8B_BPBLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD35_SHIFT);
  (void)LCD_WF8B_BPBLCD17_MASK;
  (void)LCD_WF8B_BPBLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD17_SHIFT);
  (void)LCD_WF8B_BPBLCD41_MASK;
  (void)LCD_WF8B_BPBLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD41_SHIFT);
  (void)LCD_WF8B_BPBLCD11_MASK;
  (void)LCD_WF8B_BPBLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD11_SHIFT);
  (void)LCD_WF8B_BPBLCD46_MASK;
  (void)LCD_WF8B_BPBLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD46_SHIFT);
  (void)LCD_WF8B_BPBLCD57_MASK;
  (void)LCD_WF8B_BPBLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD57_SHIFT);
  (void)LCD_WF8B_BPBLCD42_MASK;
  (void)LCD_WF8B_BPBLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD42_SHIFT);
  (void)LCD_WF8B_BPBLCD5_MASK;
  (void)LCD_WF8B_BPBLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD5_SHIFT);
  (void)LCD_WF8B_BPBLCD3_MASK;
  (void)LCD_WF8B_BPBLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD3_SHIFT);
  (void)LCD_WF8B_BPBLCD16_MASK;
  (void)LCD_WF8B_BPBLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD16_SHIFT);
  (void)LCD_WF8B_BPBLCD13_MASK;
  (void)LCD_WF8B_BPBLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPBLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPBLCD13_SHIFT);
  (void)LCD_WF8B_BPCLCD10_MASK;
  (void)LCD_WF8B_BPCLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD10_SHIFT);
  (void)LCD_WF8B_BPCLCD55_MASK;
  (void)LCD_WF8B_BPCLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD55_SHIFT);
  (void)LCD_WF8B_BPCLCD2_MASK;
  (void)LCD_WF8B_BPCLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD2_SHIFT);
  (void)LCD_WF8B_BPCLCD23_MASK;
  (void)LCD_WF8B_BPCLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD23_SHIFT);
  (void)LCD_WF8B_BPCLCD48_MASK;
  (void)LCD_WF8B_BPCLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD48_SHIFT);
  (void)LCD_WF8B_BPCLCD24_MASK;
  (void)LCD_WF8B_BPCLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD24_SHIFT);
  (void)LCD_WF8B_BPCLCD60_MASK;
  (void)LCD_WF8B_BPCLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD60_SHIFT);
  (void)LCD_WF8B_BPCLCD47_MASK;
  (void)LCD_WF8B_BPCLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD47_SHIFT);
  (void)LCD_WF8B_BPCLCD22_MASK;
  (void)LCD_WF8B_BPCLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD22_SHIFT);
  (void)LCD_WF8B_BPCLCD8_MASK;
  (void)LCD_WF8B_BPCLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD8_SHIFT);
  (void)LCD_WF8B_BPCLCD21_MASK;
  (void)LCD_WF8B_BPCLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD21_SHIFT);
  (void)LCD_WF8B_BPCLCD49_MASK;
  (void)LCD_WF8B_BPCLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD49_SHIFT);
  (void)LCD_WF8B_BPCLCD25_MASK;
  (void)LCD_WF8B_BPCLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD25_SHIFT);
  (void)LCD_WF8B_BPCLCD1_MASK;
  (void)LCD_WF8B_BPCLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD1_SHIFT);
  (void)LCD_WF8B_BPCLCD20_MASK;
  (void)LCD_WF8B_BPCLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD20_SHIFT);
  (void)LCD_WF8B_BPCLCD50_MASK;
  (void)LCD_WF8B_BPCLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD50_SHIFT);
  (void)LCD_WF8B_BPCLCD19_MASK;
  (void)LCD_WF8B_BPCLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD19_SHIFT);
  (void)LCD_WF8B_BPCLCD26_MASK;
  (void)LCD_WF8B_BPCLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD26_SHIFT);
  (void)LCD_WF8B_BPCLCD59_MASK;
  (void)LCD_WF8B_BPCLCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD59_SHIFT);
  (void)LCD_WF8B_BPCLCD61_MASK;
  (void)LCD_WF8B_BPCLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD61_SHIFT);
  (void)LCD_WF8B_BPCLCD46_MASK;
  (void)LCD_WF8B_BPCLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD46_SHIFT);
  (void)LCD_WF8B_BPCLCD18_MASK;
  (void)LCD_WF8B_BPCLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD18_SHIFT);
  (void)LCD_WF8B_BPCLCD5_MASK;
  (void)LCD_WF8B_BPCLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD5_SHIFT);
  (void)LCD_WF8B_BPCLCD63_MASK;
  (void)LCD_WF8B_BPCLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD63_SHIFT);
  (void)LCD_WF8B_BPCLCD27_MASK;
  (void)LCD_WF8B_BPCLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD27_SHIFT);
  (void)LCD_WF8B_BPCLCD17_MASK;
  (void)LCD_WF8B_BPCLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD17_SHIFT);
  (void)LCD_WF8B_BPCLCD51_MASK;
  (void)LCD_WF8B_BPCLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD51_SHIFT);
  (void)LCD_WF8B_BPCLCD9_MASK;
  (void)LCD_WF8B_BPCLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD9_SHIFT);
  (void)LCD_WF8B_BPCLCD54_MASK;
  (void)LCD_WF8B_BPCLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD54_SHIFT);
  (void)LCD_WF8B_BPCLCD15_MASK;
  (void)LCD_WF8B_BPCLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD15_SHIFT);
  (void)LCD_WF8B_BPCLCD16_MASK;
  (void)LCD_WF8B_BPCLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD16_SHIFT);
  (void)LCD_WF8B_BPCLCD14_MASK;
  (void)LCD_WF8B_BPCLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD14_SHIFT);
  (void)LCD_WF8B_BPCLCD32_MASK;
  (void)LCD_WF8B_BPCLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD32_SHIFT);
  (void)LCD_WF8B_BPCLCD28_MASK;
  (void)LCD_WF8B_BPCLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD28_SHIFT);
  (void)LCD_WF8B_BPCLCD53_MASK;
  (void)LCD_WF8B_BPCLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD53_SHIFT);
  (void)LCD_WF8B_BPCLCD33_MASK;
  (void)LCD_WF8B_BPCLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD33_SHIFT);
  (void)LCD_WF8B_BPCLCD0_MASK;
  (void)LCD_WF8B_BPCLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD0_SHIFT);
  (void)LCD_WF8B_BPCLCD43_MASK;
  (void)LCD_WF8B_BPCLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD43_SHIFT);
  (void)LCD_WF8B_BPCLCD7_MASK;
  (void)LCD_WF8B_BPCLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD7_SHIFT);
  (void)LCD_WF8B_BPCLCD4_MASK;
  (void)LCD_WF8B_BPCLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD4_SHIFT);
  (void)LCD_WF8B_BPCLCD34_MASK;
  (void)LCD_WF8B_BPCLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD34_SHIFT);
  (void)LCD_WF8B_BPCLCD29_MASK;
  (void)LCD_WF8B_BPCLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD29_SHIFT);
  (void)LCD_WF8B_BPCLCD45_MASK;
  (void)LCD_WF8B_BPCLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD45_SHIFT);
  (void)LCD_WF8B_BPCLCD57_MASK;
  (void)LCD_WF8B_BPCLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD57_SHIFT);
  (void)LCD_WF8B_BPCLCD42_MASK;
  (void)LCD_WF8B_BPCLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD42_SHIFT);
  (void)LCD_WF8B_BPCLCD35_MASK;
  (void)LCD_WF8B_BPCLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD35_SHIFT);
  (void)LCD_WF8B_BPCLCD13_MASK;
  (void)LCD_WF8B_BPCLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD13_SHIFT);
  (void)LCD_WF8B_BPCLCD36_MASK;
  (void)LCD_WF8B_BPCLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD36_SHIFT);
  (void)LCD_WF8B_BPCLCD30_MASK;
  (void)LCD_WF8B_BPCLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD30_SHIFT);
  (void)LCD_WF8B_BPCLCD52_MASK;
  (void)LCD_WF8B_BPCLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD52_SHIFT);
  (void)LCD_WF8B_BPCLCD58_MASK;
  (void)LCD_WF8B_BPCLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD58_SHIFT);
  (void)LCD_WF8B_BPCLCD41_MASK;
  (void)LCD_WF8B_BPCLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD41_SHIFT);
  (void)LCD_WF8B_BPCLCD37_MASK;
  (void)LCD_WF8B_BPCLCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD37_SHIFT);
  (void)LCD_WF8B_BPCLCD3_MASK;
  (void)LCD_WF8B_BPCLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD3_SHIFT);
  (void)LCD_WF8B_BPCLCD12_MASK;
  (void)LCD_WF8B_BPCLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD12_SHIFT);
  (void)LCD_WF8B_BPCLCD11_MASK;
  (void)LCD_WF8B_BPCLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD11_SHIFT);
  (void)LCD_WF8B_BPCLCD38_MASK;
  (void)LCD_WF8B_BPCLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD38_SHIFT);
  (void)LCD_WF8B_BPCLCD44_MASK;
  (void)LCD_WF8B_BPCLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD44_SHIFT);
  (void)LCD_WF8B_BPCLCD31_MASK;
  (void)LCD_WF8B_BPCLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD31_SHIFT);
  (void)LCD_WF8B_BPCLCD40_MASK;
  (void)LCD_WF8B_BPCLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD40_SHIFT);
  (void)LCD_WF8B_BPCLCD62_MASK;
  (void)LCD_WF8B_BPCLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD62_SHIFT);
  (void)LCD_WF8B_BPCLCD56_MASK;
  (void)LCD_WF8B_BPCLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD56_SHIFT);
  (void)LCD_WF8B_BPCLCD39_MASK;
  (void)LCD_WF8B_BPCLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD39_SHIFT);
  (void)LCD_WF8B_BPCLCD6_MASK;
  (void)LCD_WF8B_BPCLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPCLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPCLCD6_SHIFT);
  (void)LCD_WF8B_BPDLCD47_MASK;
  (void)LCD_WF8B_BPDLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD47_SHIFT);
  (void)LCD_WF8B_BPDLCD23_MASK;
  (void)LCD_WF8B_BPDLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD23_SHIFT);
  (void)LCD_WF8B_BPDLCD48_MASK;
  (void)LCD_WF8B_BPDLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD48_SHIFT);
  (void)LCD_WF8B_BPDLCD24_MASK;
  (void)LCD_WF8B_BPDLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD24_SHIFT);
  (void)LCD_WF8B_BPDLCD15_MASK;
  (void)LCD_WF8B_BPDLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD15_SHIFT);
  (void)LCD_WF8B_BPDLCD22_MASK;
  (void)LCD_WF8B_BPDLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD22_SHIFT);
  (void)LCD_WF8B_BPDLCD60_MASK;
  (void)LCD_WF8B_BPDLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD60_SHIFT);
  (void)LCD_WF8B_BPDLCD10_MASK;
  (void)LCD_WF8B_BPDLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD10_SHIFT);
  (void)LCD_WF8B_BPDLCD21_MASK;
  (void)LCD_WF8B_BPDLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD21_SHIFT);
  (void)LCD_WF8B_BPDLCD49_MASK;
  (void)LCD_WF8B_BPDLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD49_SHIFT);
  (void)LCD_WF8B_BPDLCD1_MASK;
  (void)LCD_WF8B_BPDLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD1_SHIFT);
  (void)LCD_WF8B_BPDLCD25_MASK;
  (void)LCD_WF8B_BPDLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD25_SHIFT);
  (void)LCD_WF8B_BPDLCD20_MASK;
  (void)LCD_WF8B_BPDLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD20_SHIFT);
  (void)LCD_WF8B_BPDLCD2_MASK;
  (void)LCD_WF8B_BPDLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD2_SHIFT);
  (void)LCD_WF8B_BPDLCD55_MASK;
  (void)LCD_WF8B_BPDLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD55_SHIFT);
  (void)LCD_WF8B_BPDLCD59_MASK;
  (void)LCD_WF8B_BPDLCD59_SHIFT;
