kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
  LCD_WF0 |= LCD_WF8B_BPDLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD59_SHIFT);
  (void)LCD_WF8B_BPDLCD5_MASK;
  (void)LCD_WF8B_BPDLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD5_SHIFT);
  (void)LCD_WF8B_BPDLCD19_MASK;
  (void)LCD_WF8B_BPDLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD19_SHIFT);
  (void)LCD_WF8B_BPDLCD6_MASK;
  (void)LCD_WF8B_BPDLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD6_SHIFT);
  (void)LCD_WF8B_BPDLCD26_MASK;
  (void)LCD_WF8B_BPDLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD26_SHIFT);
  (void)LCD_WF8B_BPDLCD0_MASK;
  (void)LCD_WF8B_BPDLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD0_SHIFT);
  (void)LCD_WF8B_BPDLCD50_MASK;
  (void)LCD_WF8B_BPDLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD50_SHIFT);
  (void)LCD_WF8B_BPDLCD46_MASK;
  (void)LCD_WF8B_BPDLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD46_SHIFT);
  (void)LCD_WF8B_BPDLCD18_MASK;
  (void)LCD_WF8B_BPDLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD18_SHIFT);
  (void)LCD_WF8B_BPDLCD61_MASK;
  (void)LCD_WF8B_BPDLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD61_SHIFT);
  (void)LCD_WF8B_BPDLCD9_MASK;
  (void)LCD_WF8B_BPDLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD9_SHIFT);
  (void)LCD_WF8B_BPDLCD17_MASK;
  (void)LCD_WF8B_BPDLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD17_SHIFT);
  (void)LCD_WF8B_BPDLCD27_MASK;
  (void)LCD_WF8B_BPDLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD27_SHIFT);
  (void)LCD_WF8B_BPDLCD53_MASK;
  (void)LCD_WF8B_BPDLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD53_SHIFT);
  (void)LCD_WF8B_BPDLCD51_MASK;
  (void)LCD_WF8B_BPDLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD51_SHIFT);
  (void)LCD_WF8B_BPDLCD54_MASK;
  (void)LCD_WF8B_BPDLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD54_SHIFT);
  (void)LCD_WF8B_BPDLCD13_MASK;
  (void)LCD_WF8B_BPDLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD13_SHIFT);
  (void)LCD_WF8B_BPDLCD16_MASK;
  (void)LCD_WF8B_BPDLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD16_SHIFT);
  (void)LCD_WF8B_BPDLCD32_MASK;
  (void)LCD_WF8B_BPDLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD32_SHIFT);
  (void)LCD_WF8B_BPDLCD14_MASK;
  (void)LCD_WF8B_BPDLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD14_SHIFT);
  (void)LCD_WF8B_BPDLCD28_MASK;
  (void)LCD_WF8B_BPDLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD28_SHIFT);
  (void)LCD_WF8B_BPDLCD43_MASK;
  (void)LCD_WF8B_BPDLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD43_SHIFT);
  (void)LCD_WF8B_BPDLCD4_MASK;
  (void)LCD_WF8B_BPDLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD4_SHIFT);
  (void)LCD_WF8B_BPDLCD45_MASK;
  (void)LCD_WF8B_BPDLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD45_SHIFT);
  (void)LCD_WF8B_BPDLCD8_MASK;
  (void)LCD_WF8B_BPDLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD8_SHIFT);
  (void)LCD_WF8B_BPDLCD62_MASK;
  (void)LCD_WF8B_BPDLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD62_SHIFT);
  (void)LCD_WF8B_BPDLCD33_MASK;
  (void)LCD_WF8B_BPDLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD33_SHIFT);
  (void)LCD_WF8B_BPDLCD34_MASK;
  (void)LCD_WF8B_BPDLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD34_SHIFT);
  (void)LCD_WF8B_BPDLCD29_MASK;
  (void)LCD_WF8B_BPDLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD29_SHIFT);
  (void)LCD_WF8B_BPDLCD58_MASK;
  (void)LCD_WF8B_BPDLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD58_SHIFT);
  (void)LCD_WF8B_BPDLCD57_MASK;
  (void)LCD_WF8B_BPDLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD57_SHIFT);
  (void)LCD_WF8B_BPDLCD42_MASK;
  (void)LCD_WF8B_BPDLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD42_SHIFT);
  (void)LCD_WF8B_BPDLCD35_MASK;
  (void)LCD_WF8B_BPDLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD35_SHIFT);
  (void)LCD_WF8B_BPDLCD52_MASK;
  (void)LCD_WF8B_BPDLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD52_SHIFT);
  (void)LCD_WF8B_BPDLCD7_MASK;
  (void)LCD_WF8B_BPDLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD7_SHIFT);
  (void)LCD_WF8B_BPDLCD36_MASK;
  (void)LCD_WF8B_BPDLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD36_SHIFT);
  (void)LCD_WF8B_BPDLCD30_MASK;
  (void)LCD_WF8B_BPDLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD30_SHIFT);
  (void)LCD_WF8B_BPDLCD41_MASK;
  (void)LCD_WF8B_BPDLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD41_SHIFT);
  (void)LCD_WF8B_BPDLCD37_MASK;
  (void)LCD_WF8B_BPDLCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD37_SHIFT);
  (void)LCD_WF8B_BPDLCD44_MASK;
  (void)LCD_WF8B_BPDLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD44_SHIFT);
  (void)LCD_WF8B_BPDLCD63_MASK;
  (void)LCD_WF8B_BPDLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD63_SHIFT);
  (void)LCD_WF8B_BPDLCD38_MASK;
  (void)LCD_WF8B_BPDLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD38_SHIFT);
  (void)LCD_WF8B_BPDLCD56_MASK;
  (void)LCD_WF8B_BPDLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD56_SHIFT);
  (void)LCD_WF8B_BPDLCD40_MASK;
  (void)LCD_WF8B_BPDLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD40_SHIFT);
  (void)LCD_WF8B_BPDLCD31_MASK;
  (void)LCD_WF8B_BPDLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD31_SHIFT);
  (void)LCD_WF8B_BPDLCD12_MASK;
  (void)LCD_WF8B_BPDLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD12_SHIFT);
  (void)LCD_WF8B_BPDLCD39_MASK;
  (void)LCD_WF8B_BPDLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD39_SHIFT);
  (void)LCD_WF8B_BPDLCD3_MASK;
  (void)LCD_WF8B_BPDLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD3_SHIFT);
  (void)LCD_WF8B_BPDLCD11_MASK;
  (void)LCD_WF8B_BPDLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPDLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPDLCD11_SHIFT);
  (void)LCD_WF8B_BPELCD12_MASK;
  (void)LCD_WF8B_BPELCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD12_SHIFT);
  (void)LCD_WF8B_BPELCD39_MASK;
  (void)LCD_WF8B_BPELCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD39_SHIFT);
  (void)LCD_WF8B_BPELCD3_MASK;
  (void)LCD_WF8B_BPELCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD3_SHIFT);
  (void)LCD_WF8B_BPELCD38_MASK;
  (void)LCD_WF8B_BPELCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD38_SHIFT);
  (void)LCD_WF8B_BPELCD40_MASK;
  (void)LCD_WF8B_BPELCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD40_SHIFT);
  (void)LCD_WF8B_BPELCD37_MASK;
  (void)LCD_WF8B_BPELCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD37_SHIFT);
  (void)LCD_WF8B_BPELCD41_MASK;
  (void)LCD_WF8B_BPELCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD41_SHIFT);
  (void)LCD_WF8B_BPELCD36_MASK;
  (void)LCD_WF8B_BPELCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD36_SHIFT);
  (void)LCD_WF8B_BPELCD8_MASK;
  (void)LCD_WF8B_BPELCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD8_SHIFT);
  (void)LCD_WF8B_BPELCD35_MASK;
  (void)LCD_WF8B_BPELCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD35_SHIFT);
  (void)LCD_WF8B_BPELCD42_MASK;
  (void)LCD_WF8B_BPELCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD42_SHIFT);
  (void)LCD_WF8B_BPELCD34_MASK;
  (void)LCD_WF8B_BPELCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD34_SHIFT);
  (void)LCD_WF8B_BPELCD33_MASK;
  (void)LCD_WF8B_BPELCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD33_SHIFT);
  (void)LCD_WF8B_BPELCD11_MASK;
  (void)LCD_WF8B_BPELCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD11_SHIFT);
  (void)LCD_WF8B_BPELCD43_MASK;
  (void)LCD_WF8B_BPELCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD43_SHIFT);
  (void)LCD_WF8B_BPELCD32_MASK;
  (void)LCD_WF8B_BPELCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD32_SHIFT);
  (void)LCD_WF8B_BPELCD31_MASK;
  (void)LCD_WF8B_BPELCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD31_SHIFT);
  (void)LCD_WF8B_BPELCD44_MASK;
  (void)LCD_WF8B_BPELCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD44_SHIFT);
  (void)LCD_WF8B_BPELCD30_MASK;
  (void)LCD_WF8B_BPELCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD30_SHIFT);
  (void)LCD_WF8B_BPELCD29_MASK;
  (void)LCD_WF8B_BPELCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD29_SHIFT);
  (void)LCD_WF8B_BPELCD7_MASK;
  (void)LCD_WF8B_BPELCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD7_SHIFT);
  (void)LCD_WF8B_BPELCD45_MASK;
  (void)LCD_WF8B_BPELCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD45_SHIFT);
  (void)LCD_WF8B_BPELCD28_MASK;
  (void)LCD_WF8B_BPELCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD28_SHIFT);
  (void)LCD_WF8B_BPELCD2_MASK;
  (void)LCD_WF8B_BPELCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD2_SHIFT);
  (void)LCD_WF8B_BPELCD27_MASK;
  (void)LCD_WF8B_BPELCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD27_SHIFT);
  (void)LCD_WF8B_BPELCD46_MASK;
  (void)LCD_WF8B_BPELCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD46_SHIFT);
  (void)LCD_WF8B_BPELCD26_MASK;
  (void)LCD_WF8B_BPELCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD26_SHIFT);
  (void)LCD_WF8B_BPELCD10_MASK;
  (void)LCD_WF8B_BPELCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD10_SHIFT);
  (void)LCD_WF8B_BPELCD13_MASK;
  (void)LCD_WF8B_BPELCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD13_SHIFT);
  (void)LCD_WF8B_BPELCD25_MASK;
  (void)LCD_WF8B_BPELCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD25_SHIFT);
  (void)LCD_WF8B_BPELCD5_MASK;
  (void)LCD_WF8B_BPELCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD5_SHIFT);
  (void)LCD_WF8B_BPELCD24_MASK;
  (void)LCD_WF8B_BPELCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD24_SHIFT);
  (void)LCD_WF8B_BPELCD47_MASK;
  (void)LCD_WF8B_BPELCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD47_SHIFT);
  (void)LCD_WF8B_BPELCD23_MASK;
  (void)LCD_WF8B_BPELCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD23_SHIFT);
  (void)LCD_WF8B_BPELCD22_MASK;
  (void)LCD_WF8B_BPELCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD22_SHIFT);
  (void)LCD_WF8B_BPELCD48_MASK;
  (void)LCD_WF8B_BPELCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD48_SHIFT);
  (void)LCD_WF8B_BPELCD21_MASK;
  (void)LCD_WF8B_BPELCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD21_SHIFT);
  (void)LCD_WF8B_BPELCD49_MASK;
  (void)LCD_WF8B_BPELCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD49_SHIFT);
  (void)LCD_WF8B_BPELCD20_MASK;
  (void)LCD_WF8B_BPELCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD20_SHIFT);
  (void)LCD_WF8B_BPELCD19_MASK;
  (void)LCD_WF8B_BPELCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD19_SHIFT);
  (void)LCD_WF8B_BPELCD9_MASK;
  (void)LCD_WF8B_BPELCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD9_SHIFT);
  (void)LCD_WF8B_BPELCD50_MASK;
  (void)LCD_WF8B_BPELCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD50_SHIFT);
  (void)LCD_WF8B_BPELCD18_MASK;
  (void)LCD_WF8B_BPELCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD18_SHIFT);
  (void)LCD_WF8B_BPELCD6_MASK;
  (void)LCD_WF8B_BPELCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD6_SHIFT);
  (void)LCD_WF8B_BPELCD17_MASK;
  (void)LCD_WF8B_BPELCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD17_SHIFT);
  (void)LCD_WF8B_BPELCD51_MASK;
  (void)LCD_WF8B_BPELCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD51_SHIFT);
  (void)LCD_WF8B_BPELCD16_MASK;
  (void)LCD_WF8B_BPELCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD16_SHIFT);
  (void)LCD_WF8B_BPELCD56_MASK;
  (void)LCD_WF8B_BPELCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD56_SHIFT);
  (void)LCD_WF8B_BPELCD57_MASK;
  (void)LCD_WF8B_BPELCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD57_SHIFT);
  (void)LCD_WF8B_BPELCD52_MASK;
  (void)LCD_WF8B_BPELCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD52_SHIFT);
  (void)LCD_WF8B_BPELCD1_MASK;
  (void)LCD_WF8B_BPELCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD1_SHIFT);
  (void)LCD_WF8B_BPELCD58_MASK;
  (void)LCD_WF8B_BPELCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD58_SHIFT);
  (void)LCD_WF8B_BPELCD59_MASK;
  (void)LCD_WF8B_BPELCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD59_SHIFT);
  (void)LCD_WF8B_BPELCD53_MASK;
  (void)LCD_WF8B_BPELCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD53_SHIFT);
  (void)LCD_WF8B_BPELCD14_MASK;
  (void)LCD_WF8B_BPELCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD14_SHIFT);
  (void)LCD_WF8B_BPELCD0_MASK;
  (void)LCD_WF8B_BPELCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD0_SHIFT);
  (void)LCD_WF8B_BPELCD60_MASK;
  (void)LCD_WF8B_BPELCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD60_SHIFT);
  (void)LCD_WF8B_BPELCD15_MASK;
  (void)LCD_WF8B_BPELCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD15_SHIFT);
  (void)LCD_WF8B_BPELCD61_MASK;
  (void)LCD_WF8B_BPELCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD61_SHIFT);
  (void)LCD_WF8B_BPELCD54_MASK;
  (void)LCD_WF8B_BPELCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD54_SHIFT);
  (void)LCD_WF8B_BPELCD62_MASK;
  (void)LCD_WF8B_BPELCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD62_SHIFT);
  (void)LCD_WF8B_BPELCD63_MASK;
  (void)LCD_WF8B_BPELCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD63_SHIFT);
  (void)LCD_WF8B_BPELCD55_MASK;
  (void)LCD_WF8B_BPELCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD55_SHIFT);
  (void)LCD_WF8B_BPELCD4_MASK;
  (void)LCD_WF8B_BPELCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPELCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPELCD4_SHIFT);
  (void)LCD_WF8B_BPFLCD13_MASK;
  (void)LCD_WF8B_BPFLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD13_SHIFT);
  (void)LCD_WF8B_BPFLCD39_MASK;
  (void)LCD_WF8B_BPFLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD39_SHIFT);
  (void)LCD_WF8B_BPFLCD55_MASK;
  (void)LCD_WF8B_BPFLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD55_SHIFT);
  (void)LCD_WF8B_BPFLCD47_MASK;
  (void)LCD_WF8B_BPFLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD47_SHIFT);
  (void)LCD_WF8B_BPFLCD63_MASK;
  (void)LCD_WF8B_BPFLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD63_SHIFT);
  (void)LCD_WF8B_BPFLCD43_MASK;
  (void)LCD_WF8B_BPFLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD43_SHIFT);
  (void)LCD_WF8B_BPFLCD5_MASK;
  (void)LCD_WF8B_BPFLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD5_SHIFT);
  (void)LCD_WF8B_BPFLCD62_MASK;
  (void)LCD_WF8B_BPFLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD62_SHIFT);
  (void)LCD_WF8B_BPFLCD14_MASK;
  (void)LCD_WF8B_BPFLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD14_SHIFT);
  (void)LCD_WF8B_BPFLCD24_MASK;
  (void)LCD_WF8B_BPFLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD24_SHIFT);
  (void)LCD_WF8B_BPFLCD54_MASK;
  (void)LCD_WF8B_BPFLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD54_SHIFT);
  (void)LCD_WF8B_BPFLCD15_MASK;
  (void)LCD_WF8B_BPFLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD15_SHIFT);
  (void)LCD_WF8B_BPFLCD32_MASK;
  (void)LCD_WF8B_BPFLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD32_SHIFT);
  (void)LCD_WF8B_BPFLCD61_MASK;
  (void)LCD_WF8B_BPFLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD61_SHIFT);
  (void)LCD_WF8B_BPFLCD25_MASK;
  (void)LCD_WF8B_BPFLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD25_SHIFT);
  (void)LCD_WF8B_BPFLCD60_MASK;
  (void)LCD_WF8B_BPFLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD60_SHIFT);
  (void)LCD_WF8B_BPFLCD41_MASK;
  (void)LCD_WF8B_BPFLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD41_SHIFT);
  (void)LCD_WF8B_BPFLCD33_MASK;
  (void)LCD_WF8B_BPFLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD33_SHIFT);
  (void)LCD_WF8B_BPFLCD53_MASK;
  (void)LCD_WF8B_BPFLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD53_SHIFT);
  (void)LCD_WF8B_BPFLCD59_MASK;
  (void)LCD_WF8B_BPFLCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD59_SHIFT);
  (void)LCD_WF8B_BPFLCD0_MASK;
  (void)LCD_WF8B_BPFLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD0_SHIFT);
  (void)LCD_WF8B_BPFLCD46_MASK;
  (void)LCD_WF8B_BPFLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD46_SHIFT);
  (void)LCD_WF8B_BPFLCD58_MASK;
  (void)LCD_WF8B_BPFLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD58_SHIFT);
  (void)LCD_WF8B_BPFLCD26_MASK;
  (void)LCD_WF8B_BPFLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD26_SHIFT);
  (void)LCD_WF8B_BPFLCD36_MASK;
  (void)LCD_WF8B_BPFLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD36_SHIFT);
  (void)LCD_WF8B_BPFLCD10_MASK;
  (void)LCD_WF8B_BPFLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD10_SHIFT);
  (void)LCD_WF8B_BPFLCD52_MASK;
  (void)LCD_WF8B_BPFLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD52_SHIFT);
  (void)LCD_WF8B_BPFLCD57_MASK;
  (void)LCD_WF8B_BPFLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD57_SHIFT);
  (void)LCD_WF8B_BPFLCD27_MASK;
  (void)LCD_WF8B_BPFLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD27_SHIFT);
  (void)LCD_WF8B_BPFLCD11_MASK;
  (void)LCD_WF8B_BPFLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD11_SHIFT);
  (void)LCD_WF8B_BPFLCD56_MASK;
  (void)LCD_WF8B_BPFLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD56_SHIFT);
  (void)LCD_WF8B_BPFLCD1_MASK;
  (void)LCD_WF8B_BPFLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD1_SHIFT);
  (void)LCD_WF8B_BPFLCD8_MASK;
  (void)LCD_WF8B_BPFLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD8_SHIFT);
  (void)LCD_WF8B_BPFLCD40_MASK;
  (void)LCD_WF8B_BPFLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD40_SHIFT);
  (void)LCD_WF8B_BPFLCD51_MASK;
  (void)LCD_WF8B_BPFLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD51_SHIFT);
  (void)LCD_WF8B_BPFLCD16_MASK;
  (void)LCD_WF8B_BPFLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD16_SHIFT);
  (void)LCD_WF8B_BPFLCD45_MASK;
  (void)LCD_WF8B_BPFLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD45_SHIFT);
  (void)LCD_WF8B_BPFLCD6_MASK;
  (void)LCD_WF8B_BPFLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD6_SHIFT);
  (void)LCD_WF8B_BPFLCD17_MASK;
  (void)LCD_WF8B_BPFLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD17_SHIFT);
  (void)LCD_WF8B_BPFLCD28_MASK;
  (void)LCD_WF8B_BPFLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD28_SHIFT);
  (void)LCD_WF8B_BPFLCD42_MASK;
  (void)LCD_WF8B_BPFLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD42_SHIFT);
  (void)LCD_WF8B_BPFLCD29_MASK;
  (void)LCD_WF8B_BPFLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD29_SHIFT);
  (void)LCD_WF8B_BPFLCD50_MASK;
  (void)LCD_WF8B_BPFLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD50_SHIFT);
  (void)LCD_WF8B_BPFLCD18_MASK;
  (void)LCD_WF8B_BPFLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD18_SHIFT);
  (void)LCD_WF8B_BPFLCD34_MASK;
  (void)LCD_WF8B_BPFLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD34_SHIFT);
  (void)LCD_WF8B_BPFLCD19_MASK;
  (void)LCD_WF8B_BPFLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD19_SHIFT);
  (void)LCD_WF8B_BPFLCD2_MASK;
  (void)LCD_WF8B_BPFLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD2_SHIFT);
  (void)LCD_WF8B_BPFLCD9_MASK;
  (void)LCD_WF8B_BPFLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD9_SHIFT);
  (void)LCD_WF8B_BPFLCD3_MASK;
  (void)LCD_WF8B_BPFLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD3_SHIFT);
