kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
void test_SCB(void) {
  (void)SystemControl_BASE_PTR;
  SCB_ICSR = SCB_ICSR + 1;
  SCB_VTOR = SCB_VTOR + 1;
  SCB_AIRCR = SCB_AIRCR + 1;
  SCB_SCR = SCB_SCR + 1;
  SCB_SHPR2 = SCB_SHPR2 + 1;
  SCB_SHPR3 = SCB_SHPR3 + 1;
  SCB_SHCSR = SCB_SHCSR + 1;
  SCB_DFSR = SCB_DFSR + 1;
  (void)SCB_CPUID_REVISION_MASK;
  (void)SCB_CPUID_REVISION_SHIFT;
  (void)SCB_CPUID_REVISION(1);
  SCB_CPUID |= SCB_CPUID_REVISION_MASK;
  SCB_CPUID &= ~(1U << SCB_CPUID_REVISION_SHIFT);
  (void)SCB_CPUID_PARTNO_MASK;
  (void)SCB_CPUID_PARTNO_SHIFT;
  (void)SCB_CPUID_PARTNO(1);
  SCB_CPUID |= SCB_CPUID_PARTNO_MASK;
  SCB_CPUID &= ~(1U << SCB_CPUID_PARTNO_SHIFT);
  (void)SCB_CPUID_VARIANT_MASK;
  (void)SCB_CPUID_VARIANT_SHIFT;
  (void)SCB_CPUID_VARIANT(1);
  SCB_CPUID |= SCB_CPUID_VARIANT_MASK;
  SCB_CPUID &= ~(1U << SCB_CPUID_VARIANT_SHIFT);
  (void)SCB_CPUID_IMPLEMENTER_MASK;
  (void)SCB_CPUID_IMPLEMENTER_SHIFT;
  (void)SCB_CPUID_IMPLEMENTER(1);
  SCB_CPUID |= SCB_CPUID_IMPLEMENTER_MASK;
  SCB_CPUID &= ~(1U << SCB_CPUID_IMPLEMENTER_SHIFT);
  SCB_ICSR_REG(SystemControl_BASE_PTR) = SCB_ICSR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_ICSR_VECTACTIVE_MASK;
  (void)SCB_ICSR_VECTACTIVE_SHIFT;
  (void)SCB_ICSR_VECTACTIVE(1);
  SCB_ICSR |= SCB_ICSR_VECTACTIVE_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_VECTACTIVE_SHIFT);
  (void)SCB_ICSR_VECTPENDING_MASK;
  (void)SCB_ICSR_VECTPENDING_SHIFT;
  (void)SCB_ICSR_VECTPENDING(1);
  SCB_ICSR |= SCB_ICSR_VECTPENDING_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_VECTPENDING_SHIFT);
  (void)SCB_ICSR_ISRPENDING_MASK;
  (void)SCB_ICSR_ISRPENDING_SHIFT;
  SCB_ICSR |= SCB_ICSR_ISRPENDING_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_ISRPENDING_SHIFT);
  (void)SCB_ICSR_PENDSTCLR_MASK;
  (void)SCB_ICSR_PENDSTCLR_SHIFT;
  SCB_ICSR |= SCB_ICSR_PENDSTCLR_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_PENDSTCLR_SHIFT);
  (void)SCB_ICSR_PENDSTSET_MASK;
  (void)SCB_ICSR_PENDSTSET_SHIFT;
  SCB_ICSR |= SCB_ICSR_PENDSTSET_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_PENDSTSET_SHIFT);
  (void)SCB_ICSR_PENDSVCLR_MASK;
  (void)SCB_ICSR_PENDSVCLR_SHIFT;
  SCB_ICSR |= SCB_ICSR_PENDSVCLR_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_PENDSVCLR_SHIFT);
  (void)SCB_ICSR_PENDSVSET_MASK;
  (void)SCB_ICSR_PENDSVSET_SHIFT;
  SCB_ICSR |= SCB_ICSR_PENDSVSET_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_PENDSVSET_SHIFT);
  (void)SCB_ICSR_NMIPENDSET_MASK;
  (void)SCB_ICSR_NMIPENDSET_SHIFT;
  SCB_ICSR |= SCB_ICSR_NMIPENDSET_MASK;
  SCB_ICSR &= ~(1U << SCB_ICSR_NMIPENDSET_SHIFT);
  SCB_VTOR_REG(SystemControl_BASE_PTR) = SCB_VTOR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_VTOR_TBLOFF_MASK;
  (void)SCB_VTOR_TBLOFF_SHIFT;
  (void)SCB_VTOR_TBLOFF(1);
  SCB_VTOR |= SCB_VTOR_TBLOFF_MASK;
  SCB_VTOR &= ~(1U << SCB_VTOR_TBLOFF_SHIFT);
  SCB_AIRCR_REG(SystemControl_BASE_PTR) = SCB_AIRCR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_AIRCR_VECTCLRACTIVE_MASK;
  (void)SCB_AIRCR_VECTCLRACTIVE_SHIFT;
  SCB_AIRCR |= SCB_AIRCR_VECTCLRACTIVE_MASK;
  SCB_AIRCR &= ~(1U << SCB_AIRCR_VECTCLRACTIVE_SHIFT);
  (void)SCB_AIRCR_SYSRESETREQ_MASK;
  (void)SCB_AIRCR_SYSRESETREQ_SHIFT;
  SCB_AIRCR |= SCB_AIRCR_SYSRESETREQ_MASK;
  SCB_AIRCR &= ~(1U << SCB_AIRCR_SYSRESETREQ_SHIFT);
  (void)SCB_AIRCR_ENDIANNESS_MASK;
  (void)SCB_AIRCR_ENDIANNESS_SHIFT;
  SCB_AIRCR |= SCB_AIRCR_ENDIANNESS_MASK;
  SCB_AIRCR &= ~(1U << SCB_AIRCR_ENDIANNESS_SHIFT);
  (void)SCB_AIRCR_VECTKEY_MASK;
  (void)SCB_AIRCR_VECTKEY_SHIFT;
  (void)SCB_AIRCR_VECTKEY(1);
  SCB_AIRCR |= SCB_AIRCR_VECTKEY_MASK;
  SCB_AIRCR &= ~(1U << SCB_AIRCR_VECTKEY_SHIFT);
  SCB_SCR_REG(SystemControl_BASE_PTR) = SCB_SCR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_SCR_SLEEPONEXIT_MASK;
  (void)SCB_SCR_SLEEPONEXIT_SHIFT;
  SCB_SCR |= SCB_SCR_SLEEPONEXIT_MASK;
  SCB_SCR &= ~(1U << SCB_SCR_SLEEPONEXIT_SHIFT);
  (void)SCB_SCR_SLEEPDEEP_MASK;
  (void)SCB_SCR_SLEEPDEEP_SHIFT;
  SCB_SCR |= SCB_SCR_SLEEPDEEP_MASK;
  SCB_SCR &= ~(1U << SCB_SCR_SLEEPDEEP_SHIFT);
  (void)SCB_SCR_SEVONPEND_MASK;
  (void)SCB_SCR_SEVONPEND_SHIFT;
  SCB_SCR |= SCB_SCR_SEVONPEND_MASK;
  SCB_SCR &= ~(1U << SCB_SCR_SEVONPEND_SHIFT);
  (void)SCB_CCR_UNALIGN_TRP_MASK;
  (void)SCB_CCR_UNALIGN_TRP_SHIFT;
  SCB_CCR |= SCB_CCR_UNALIGN_TRP_MASK;
  SCB_CCR &= ~(1U << SCB_CCR_UNALIGN_TRP_SHIFT);
  (void)SCB_CCR_STKALIGN_MASK;
  (void)SCB_CCR_STKALIGN_SHIFT;
  SCB_CCR |= SCB_CCR_STKALIGN_MASK;
  SCB_CCR &= ~(1U << SCB_CCR_STKALIGN_SHIFT);
  SCB_SHPR2_REG(SystemControl_BASE_PTR) = SCB_SHPR2_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_SHPR2_PRI_11_MASK;
  (void)SCB_SHPR2_PRI_11_SHIFT;
  (void)SCB_SHPR2_PRI_11(1);
  SCB_SHPR2 |= SCB_SHPR2_PRI_11_MASK;
  SCB_SHPR2 &= ~(1U << SCB_SHPR2_PRI_11_SHIFT);
  SCB_SHPR3_REG(SystemControl_BASE_PTR) = SCB_SHPR3_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_SHPR3_PRI_14_MASK;
  (void)SCB_SHPR3_PRI_14_SHIFT;
  (void)SCB_SHPR3_PRI_14(1);
  SCB_SHPR3 |= SCB_SHPR3_PRI_14_MASK;
  SCB_SHPR3 &= ~(1U << SCB_SHPR3_PRI_14_SHIFT);
  (void)SCB_SHPR3_PRI_15_MASK;
  (void)SCB_SHPR3_PRI_15_SHIFT;
  (void)SCB_SHPR3_PRI_15(1);
  SCB_SHPR3 |= SCB_SHPR3_PRI_15_MASK;
  SCB_SHPR3 &= ~(1U << SCB_SHPR3_PRI_15_SHIFT);
  SCB_SHCSR_REG(SystemControl_BASE_PTR) = SCB_SHCSR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_SHCSR_SVCALLPENDED_MASK;
  (void)SCB_SHCSR_SVCALLPENDED_SHIFT;
  SCB_SHCSR |= SCB_SHCSR_SVCALLPENDED_MASK;
  SCB_SHCSR &= ~(1U << SCB_SHCSR_SVCALLPENDED_SHIFT);
  SCB_DFSR_REG(SystemControl_BASE_PTR) = SCB_DFSR_REG(SystemControl_BASE_PTR) + 1;
  (void)SCB_DFSR_HALTED_MASK;
  (void)SCB_DFSR_HALTED_SHIFT;
  SCB_DFSR |= SCB_DFSR_HALTED_MASK;
  SCB_DFSR &= ~(1U << SCB_DFSR_HALTED_SHIFT);
  (void)SCB_DFSR_BKPT_MASK;
  (void)SCB_DFSR_BKPT_SHIFT;
  SCB_DFSR |= SCB_DFSR_BKPT_MASK;
  SCB_DFSR &= ~(1U << SCB_DFSR_BKPT_SHIFT);
  (void)SCB_DFSR_DWTTRAP_MASK;
  (void)SCB_DFSR_DWTTRAP_SHIFT;
  SCB_DFSR |= SCB_DFSR_DWTTRAP_MASK;
  SCB_DFSR &= ~(1U << SCB_DFSR_DWTTRAP_SHIFT);
  (void)SCB_DFSR_VCATCH_MASK;
  (void)SCB_DFSR_VCATCH_SHIFT;
  SCB_DFSR |= SCB_DFSR_VCATCH_MASK;
  SCB_DFSR &= ~(1U << SCB_DFSR_VCATCH_SHIFT);
  (void)SCB_DFSR_EXTERNAL_MASK;
  (void)SCB_DFSR_EXTERNAL_SHIFT;
  SCB_DFSR |= SCB_DFSR_EXTERNAL_MASK;
  SCB_DFSR &= ~(1U << SCB_DFSR_EXTERNAL_SHIFT);
}

