kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
void test_SIM(void) {
  (void)SIM_BASE_PTR;
  SIM_SOPT1 = SIM_SOPT1 + 1;
  SIM_SOPT1_CFG = SIM_SOPT1_CFG + 1;
  SIM_CTRL_REG = SIM_CTRL_REG + 1;
  SIM_SCGC4 = SIM_SCGC4 + 1;
  SIM_SCGC5 = SIM_SCGC5 + 1;
  SIM_SCGC6 = SIM_SCGC6 + 1;
  SIM_SCGC7 = SIM_SCGC7 + 1;
  SIM_CLKDIV1 = SIM_CLKDIV1 + 1;
  SIM_FCFG1 = SIM_FCFG1 + 1;
  SIM_MISC_CTL = SIM_MISC_CTL + 1;
  SIM_SOPT1_REG(SIM_BASE_PTR) = SIM_SOPT1_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SOPT1_SRAMSIZE_MASK;
  (void)SIM_SOPT1_SRAMSIZE_SHIFT;
  (void)SIM_SOPT1_SRAMSIZE(1);
  SIM_SOPT1 |= SIM_SOPT1_SRAMSIZE_MASK;
  SIM_SOPT1 &= ~(1U << SIM_SOPT1_SRAMSIZE_SHIFT);
  (void)SIM_SOPT1_OSC32KSEL_MASK;
  (void)SIM_SOPT1_OSC32KSEL_SHIFT;
  (void)SIM_SOPT1_OSC32KSEL(1);
  SIM_SOPT1 |= SIM_SOPT1_OSC32KSEL_MASK;
  SIM_SOPT1 &= ~(1U << SIM_SOPT1_OSC32KSEL_SHIFT);
  SIM_SOPT1_CFG_REG(SIM_BASE_PTR) = SIM_SOPT1_CFG_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SOPT1_CFG_LPTMR1SEL_MASK;
  (void)SIM_SOPT1_CFG_LPTMR1SEL_SHIFT;
  (void)SIM_SOPT1_CFG_LPTMR1SEL(1);
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_LPTMR1SEL_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_LPTMR1SEL_SHIFT);
  (void)SIM_SOPT1_CFG_LPTMR2SEL_MASK;
  (void)SIM_SOPT1_CFG_LPTMR2SEL_SHIFT;
  (void)SIM_SOPT1_CFG_LPTMR2SEL(1);
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_LPTMR2SEL_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_LPTMR2SEL_SHIFT);
  (void)SIM_SOPT1_CFG_LPTMR3SEL_MASK;
  (void)SIM_SOPT1_CFG_LPTMR3SEL_SHIFT;
  (void)SIM_SOPT1_CFG_LPTMR3SEL(1);
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_LPTMR3SEL_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_LPTMR3SEL_SHIFT);
  (void)SIM_SOPT1_CFG_CMPOLPTMR0SEL_MASK;
  (void)SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT;
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_CMPOLPTMR0SEL_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT);
  (void)SIM_SOPT1_CFG_RAMSBDIS_MASK;
  (void)SIM_SOPT1_CFG_RAMSBDIS_SHIFT;
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_RAMSBDIS_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_RAMSBDIS_SHIFT);
  (void)SIM_SOPT1_CFG_RAMBPEN_MASK;
  (void)SIM_SOPT1_CFG_RAMBPEN_SHIFT;
  SIM_SOPT1_CFG |= SIM_SOPT1_CFG_RAMBPEN_MASK;
  SIM_SOPT1_CFG &= ~(1U << SIM_SOPT1_CFG_RAMBPEN_SHIFT);
  SIM_CTRL_REG_REG(SIM_BASE_PTR) = SIM_CTRL_REG_REG(SIM_BASE_PTR) + 1;
  (void)SIM_CTRL_REG_NMIDIS_MASK;
  (void)SIM_CTRL_REG_NMIDIS_SHIFT;
  SIM_CTRL_REG |= SIM_CTRL_REG_NMIDIS_MASK;
  SIM_CTRL_REG &= ~(1U << SIM_CTRL_REG_NMIDIS_SHIFT);
  (void)SIM_CTRL_REG_PLL_VLP_EN_MASK;
  (void)SIM_CTRL_REG_PLL_VLP_EN_SHIFT;
  SIM_CTRL_REG |= SIM_CTRL_REG_PLL_VLP_EN_MASK;
  SIM_CTRL_REG &= ~(1U << SIM_CTRL_REG_PLL_VLP_EN_SHIFT);
  (void)SIM_CTRL_REG_PTC2_HD_EN_MASK;
  (void)SIM_CTRL_REG_PTC2_HD_EN_SHIFT;
  SIM_CTRL_REG |= SIM_CTRL_REG_PTC2_HD_EN_MASK;
  SIM_CTRL_REG &= ~(1U << SIM_CTRL_REG_PTC2_HD_EN_SHIFT);
  (void)SIM_CTRL_REG_SAR_TRG_CLK_SEL_MASK;
  (void)SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT;
  (void)SIM_CTRL_REG_SAR_TRG_CLK_SEL(1);
  SIM_CTRL_REG |= SIM_CTRL_REG_SAR_TRG_CLK_SEL_MASK;
  SIM_CTRL_REG &= ~(1U << SIM_CTRL_REG_SAR_TRG_CLK_SEL_SHIFT);
  (void)SIM_CTRL_REG_CLKOUTSEL_MASK;
  (void)SIM_CTRL_REG_CLKOUTSEL_SHIFT;
  (void)SIM_CTRL_REG_CLKOUTSEL(1);
  SIM_CTRL_REG |= SIM_CTRL_REG_CLKOUTSEL_MASK;
  SIM_CTRL_REG &= ~(1U << SIM_CTRL_REG_CLKOUTSEL_SHIFT);
  (void)SIM_SDID_PINID_MASK;
  (void)SIM_SDID_PINID_SHIFT;
  (void)SIM_SDID_PINID(1);
  SIM_SDID |= SIM_SDID_PINID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_PINID_SHIFT);
  (void)SIM_SDID_DIEID_MASK;
  (void)SIM_SDID_DIEID_SHIFT;
  (void)SIM_SDID_DIEID(1);
  SIM_SDID |= SIM_SDID_DIEID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_DIEID_SHIFT);
  (void)SIM_SDID_REVID_MASK;
  (void)SIM_SDID_REVID_SHIFT;
  (void)SIM_SDID_REVID(1);
  SIM_SDID |= SIM_SDID_REVID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_REVID_SHIFT);
  (void)SIM_SDID_SRAMSIZE_MASK;
  (void)SIM_SDID_SRAMSIZE_SHIFT;
  (void)SIM_SDID_SRAMSIZE(1);
  SIM_SDID |= SIM_SDID_SRAMSIZE_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_SRAMSIZE_SHIFT);
  (void)SIM_SDID_ATTR_MASK;
  (void)SIM_SDID_ATTR_SHIFT;
  (void)SIM_SDID_ATTR(1);
  SIM_SDID |= SIM_SDID_ATTR_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_ATTR_SHIFT);
  (void)SIM_SDID_SERIESID_MASK;
  (void)SIM_SDID_SERIESID_SHIFT;
  (void)SIM_SDID_SERIESID(1);
  SIM_SDID |= SIM_SDID_SERIESID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_SERIESID_SHIFT);
  (void)SIM_SDID_SUBFAMID_MASK;
  (void)SIM_SDID_SUBFAMID_SHIFT;
  (void)SIM_SDID_SUBFAMID(1);
  SIM_SDID |= SIM_SDID_SUBFAMID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_SUBFAMID_SHIFT);
  (void)SIM_SDID_FAMID_MASK;
  (void)SIM_SDID_FAMID_SHIFT;
  (void)SIM_SDID_FAMID(1);
  SIM_SDID |= SIM_SDID_FAMID_MASK;
  SIM_SDID &= ~(1U << SIM_SDID_FAMID_SHIFT);
  SIM_SCGC4_REG(SIM_BASE_PTR) = SIM_SCGC4_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SCGC4_EWM_MASK;
  (void)SIM_SCGC4_EWM_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_EWM_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_EWM_SHIFT);
  (void)SIM_SCGC4_MCG_MASK;
  (void)SIM_SCGC4_MCG_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_MCG_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_MCG_SHIFT);
  (void)SIM_SCGC4_OSC_MASK;
  (void)SIM_SCGC4_OSC_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_OSC_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_OSC_SHIFT);
  (void)SIM_SCGC4_I2C0_MASK;
  (void)SIM_SCGC4_I2C0_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_I2C0_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_I2C0_SHIFT);
  (void)SIM_SCGC4_I2C1_MASK;
  (void)SIM_SCGC4_I2C1_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_I2C1_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_I2C1_SHIFT);
  (void)SIM_SCGC4_UART0_MASK;
  (void)SIM_SCGC4_UART0_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_UART0_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_UART0_SHIFT);
  (void)SIM_SCGC4_UART1_MASK;
  (void)SIM_SCGC4_UART1_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_UART1_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_UART1_SHIFT);
  (void)SIM_SCGC4_UART2_MASK;
  (void)SIM_SCGC4_UART2_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_UART2_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_UART2_SHIFT);
  (void)SIM_SCGC4_UART3_MASK;
  (void)SIM_SCGC4_UART3_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_UART3_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_UART3_SHIFT);
  (void)SIM_SCGC4_VREF_MASK;
  (void)SIM_SCGC4_VREF_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_VREF_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_VREF_SHIFT);
  (void)SIM_SCGC4_CMP0_MASK;
  (void)SIM_SCGC4_CMP0_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_CMP0_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_CMP0_SHIFT);
  (void)SIM_SCGC4_CMP1_MASK;
  (void)SIM_SCGC4_CMP1_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_CMP1_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_CMP1_SHIFT);
  (void)SIM_SCGC4_SPI0_MASK;
  (void)SIM_SCGC4_SPI0_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_SPI0_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_SPI0_SHIFT);
  (void)SIM_SCGC4_SPI1_MASK;
  (void)SIM_SCGC4_SPI1_SHIFT;
  SIM_SCGC4 |= SIM_SCGC4_SPI1_MASK;
  SIM_SCGC4 &= ~(1U << SIM_SCGC4_SPI1_SHIFT);
  SIM_SCGC5_REG(SIM_BASE_PTR) = SIM_SCGC5_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SCGC5_SLCD_MASK;
  (void)SIM_SCGC5_SLCD_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_SLCD_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_SLCD_SHIFT);
  (void)SIM_SCGC5_PORTA_MASK;
  (void)SIM_SCGC5_PORTA_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTA_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTA_SHIFT);
  (void)SIM_SCGC5_PORTB_MASK;
  (void)SIM_SCGC5_PORTB_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTB_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTB_SHIFT);
  (void)SIM_SCGC5_PORTC_MASK;
  (void)SIM_SCGC5_PORTC_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTC_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTC_SHIFT);
  (void)SIM_SCGC5_PORTD_MASK;
  (void)SIM_SCGC5_PORTD_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTD_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTD_SHIFT);
  (void)SIM_SCGC5_PORTE_MASK;
  (void)SIM_SCGC5_PORTE_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTE_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTE_SHIFT);
  (void)SIM_SCGC5_PORTF_MASK;
  (void)SIM_SCGC5_PORTF_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTF_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTF_SHIFT);
  (void)SIM_SCGC5_PORTG_MASK;
  (void)SIM_SCGC5_PORTG_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTG_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTG_SHIFT);
  (void)SIM_SCGC5_PORTH_MASK;
  (void)SIM_SCGC5_PORTH_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTH_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTH_SHIFT);
  (void)SIM_SCGC5_PORTI_MASK;
  (void)SIM_SCGC5_PORTI_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_PORTI_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_PORTI_SHIFT);
  (void)SIM_SCGC5_IRTC_MASK;
  (void)SIM_SCGC5_IRTC_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_IRTC_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_IRTC_SHIFT);
  (void)SIM_SCGC5_IRTCREGFILE_MASK;
  (void)SIM_SCGC5_IRTCREGFILE_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_IRTCREGFILE_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_IRTCREGFILE_SHIFT);
  (void)SIM_SCGC5_WDOG_MASK;
  (void)SIM_SCGC5_WDOG_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_WDOG_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_WDOG_SHIFT);
  (void)SIM_SCGC5_XBAR_MASK;
  (void)SIM_SCGC5_XBAR_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_XBAR_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_XBAR_SHIFT);
  (void)SIM_SCGC5_TMR0_MASK;
  (void)SIM_SCGC5_TMR0_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_TMR0_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_TMR0_SHIFT);
  (void)SIM_SCGC5_TMR1_MASK;
  (void)SIM_SCGC5_TMR1_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_TMR1_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_TMR1_SHIFT);
  (void)SIM_SCGC5_TMR2_MASK;
  (void)SIM_SCGC5_TMR2_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_TMR2_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_TMR2_SHIFT);
  (void)SIM_SCGC5_TMR3_MASK;
  (void)SIM_SCGC5_TMR3_SHIFT;
  SIM_SCGC5 |= SIM_SCGC5_TMR3_MASK;
  SIM_SCGC5 &= ~(1U << SIM_SCGC5_TMR3_SHIFT);
  SIM_SCGC6_REG(SIM_BASE_PTR) = SIM_SCGC6_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SCGC6_FTFA_MASK;
  (void)SIM_SCGC6_FTFA_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_FTFA_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_FTFA_SHIFT);
  (void)SIM_SCGC6_DMAMUX0_MASK;
  (void)SIM_SCGC6_DMAMUX0_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_DMAMUX0_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_DMAMUX0_SHIFT);
  (void)SIM_SCGC6_DMAMUX1_MASK;
  (void)SIM_SCGC6_DMAMUX1_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_DMAMUX1_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_DMAMUX1_SHIFT);
  (void)SIM_SCGC6_DMAMUX2_MASK;
  (void)SIM_SCGC6_DMAMUX2_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_DMAMUX2_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_DMAMUX2_SHIFT);
  (void)SIM_SCGC6_DMAMUX3_MASK;
  (void)SIM_SCGC6_DMAMUX3_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_DMAMUX3_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_DMAMUX3_SHIFT);
  (void)SIM_SCGC6_RNGA_MASK;
  (void)SIM_SCGC6_RNGA_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_RNGA_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_RNGA_SHIFT);
  (void)SIM_SCGC6_ADC_MASK;
  (void)SIM_SCGC6_ADC_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_ADC_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_ADC_SHIFT);
  (void)SIM_SCGC6_PIT0_MASK;
  (void)SIM_SCGC6_PIT0_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_PIT0_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_PIT0_SHIFT);
  (void)SIM_SCGC6_PIT1_MASK;
  (void)SIM_SCGC6_PIT1_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_PIT1_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_PIT1_SHIFT);
  (void)SIM_SCGC6_AFE_MASK;
  (void)SIM_SCGC6_AFE_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_AFE_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_AFE_SHIFT);
  (void)SIM_SCGC6_CRC_MASK;
  (void)SIM_SCGC6_CRC_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_CRC_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_CRC_SHIFT);
  (void)SIM_SCGC6_LPTMR_MASK;
  (void)SIM_SCGC6_LPTMR_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_LPTMR_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_LPTMR_SHIFT);
  (void)SIM_SCGC6_SIM_LP_MASK;
  (void)SIM_SCGC6_SIM_LP_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_SIM_LP_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_SIM_LP_SHIFT);
  (void)SIM_SCGC6_SIM_HP_MASK;
  (void)SIM_SCGC6_SIM_HP_SHIFT;
  SIM_SCGC6 |= SIM_SCGC6_SIM_HP_MASK;
  SIM_SCGC6 &= ~(1U << SIM_SCGC6_SIM_HP_SHIFT);
  SIM_SCGC7_REG(SIM_BASE_PTR) = SIM_SCGC7_REG(SIM_BASE_PTR) + 1;
  (void)SIM_SCGC7_MPU_MASK;
  (void)SIM_SCGC7_MPU_SHIFT;
  SIM_SCGC7 |= SIM_SCGC7_MPU_MASK;
  SIM_SCGC7 &= ~(1U << SIM_SCGC7_MPU_SHIFT);
  (void)SIM_SCGC7_DMA_MASK;
  (void)SIM_SCGC7_DMA_SHIFT;
  SIM_SCGC7 |= SIM_SCGC7_DMA_MASK;
  SIM_SCGC7 &= ~(1U << SIM_SCGC7_DMA_SHIFT);
  SIM_CLKDIV1_REG(SIM_BASE_PTR) = SIM_CLKDIV1_REG(SIM_BASE_PTR) + 1;
  (void)SIM_CLKDIV1_SYSCLKMODE_MASK;
  (void)SIM_CLKDIV1_SYSCLKMODE_SHIFT;
  SIM_CLKDIV1 |= SIM_CLKDIV1_SYSCLKMODE_MASK;
  SIM_CLKDIV1 &= ~(1U << SIM_CLKDIV1_SYSCLKMODE_SHIFT);
  (void)SIM_CLKDIV1_SYSDIV_MASK;
  (void)SIM_CLKDIV1_SYSDIV_SHIFT;
  (void)SIM_CLKDIV1_SYSDIV(1);
  SIM_CLKDIV1 |= SIM_CLKDIV1_SYSDIV_MASK;
  SIM_CLKDIV1 &= ~(1U << SIM_CLKDIV1_SYSDIV_SHIFT);
  SIM_FCFG1_REG(SIM_BASE_PTR) = SIM_FCFG1_REG(SIM_BASE_PTR) + 1;
  (void)SIM_FCFG1_FLASHDIS_MASK;
  (void)SIM_FCFG1_FLASHDIS_SHIFT;
  SIM_FCFG1 |= SIM_FCFG1_FLASHDIS_MASK;
  SIM_FCFG1 &= ~(1U << SIM_FCFG1_FLASHDIS_SHIFT);
  (void)SIM_FCFG1_FLASHDOZE_MASK;
  (void)SIM_FCFG1_FLASHDOZE_SHIFT;
  SIM_FCFG1 |= SIM_FCFG1_FLASHDOZE_MASK;
  SIM_FCFG1 &= ~(1U << SIM_FCFG1_FLASHDOZE_SHIFT);
  (void)SIM_FCFG1_PFSIZE_MASK;
  (void)SIM_FCFG1_PFSIZE_SHIFT;
  (void)SIM_FCFG1_PFSIZE(1);
  SIM_FCFG1 |= SIM_FCFG1_PFSIZE_MASK;
  SIM_FCFG1 &= ~(1U << SIM_FCFG1_PFSIZE_SHIFT);
  (void)SIM_FCFG2_MAXADDR_MASK;
  (void)SIM_FCFG2_MAXADDR_SHIFT;
  (void)SIM_FCFG2_MAXADDR(1);
  SIM_FCFG2 |= SIM_FCFG2_MAXADDR_MASK;
  SIM_FCFG2 &= ~(1U << SIM_FCFG2_MAXADDR_SHIFT);
  (void)SIM_UID0_UID_MASK;
  (void)SIM_UID0_UID_SHIFT;
  (void)SIM_UID0_UID(1);
  SIM_UID0 |= SIM_UID0_UID_MASK;
  SIM_UID0 &= ~(1U << SIM_UID0_UID_SHIFT);
  (void)SIM_UID1_UID_MASK;
  (void)SIM_UID1_UID_SHIFT;
  (void)SIM_UID1_UID(1);
  SIM_UID1 |= SIM_UID1_UID_MASK;
  SIM_UID1 &= ~(1U << SIM_UID1_UID_SHIFT);
  (void)SIM_UID2_UID_MASK;
  (void)SIM_UID2_UID_SHIFT;
  (void)SIM_UID2_UID(1);
  SIM_UID2 |= SIM_UID2_UID_MASK;
  SIM_UID2 &= ~(1U << SIM_UID2_UID_SHIFT);
  (void)SIM_UID3_UID_MASK;
  (void)SIM_UID3_UID_SHIFT;
  (void)SIM_UID3_UID(1);
  SIM_UID3 |= SIM_UID3_UID_MASK;
  SIM_UID3 &= ~(1U << SIM_UID3_UID_SHIFT);
  SIM_MISC_CTL_REG(SIM_BASE_PTR) = SIM_MISC_CTL_REG(SIM_BASE_PTR) + 1;
  (void)SIM_MISC_CTL_XBARAFEMODOUTSEL_MASK;
  (void)SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT;
  (void)SIM_MISC_CTL_XBARAFEMODOUTSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_XBARAFEMODOUTSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_XBARAFEMODOUTSEL_SHIFT);
  (void)SIM_MISC_CTL_DMADONESEL_MASK;
  (void)SIM_MISC_CTL_DMADONESEL_SHIFT;
  (void)SIM_MISC_CTL_DMADONESEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_DMADONESEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_DMADONESEL_SHIFT);
  (void)SIM_MISC_CTL_AFECLKSEL_MASK;
  (void)SIM_MISC_CTL_AFECLKSEL_SHIFT;
  (void)SIM_MISC_CTL_AFECLKSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_AFECLKSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_AFECLKSEL_SHIFT);
  (void)SIM_MISC_CTL_AFECLKPADDIR_MASK;
  (void)SIM_MISC_CTL_AFECLKPADDIR_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_AFECLKPADDIR_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_AFECLKPADDIR_SHIFT);
  (void)SIM_MISC_CTL_UARTMODTYPE_MASK;
  (void)SIM_MISC_CTL_UARTMODTYPE_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_UARTMODTYPE_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_UARTMODTYPE_SHIFT);
  (void)SIM_MISC_CTL_UART0IRSEL_MASK;
  (void)SIM_MISC_CTL_UART0IRSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_UART0IRSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_UART0IRSEL_SHIFT);
  (void)SIM_MISC_CTL_UART1IRSEL_MASK;
  (void)SIM_MISC_CTL_UART1IRSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_UART1IRSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_UART1IRSEL_SHIFT);
  (void)SIM_MISC_CTL_UART2IRSEL_MASK;
  (void)SIM_MISC_CTL_UART2IRSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_UART2IRSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_UART2IRSEL_SHIFT);
  (void)SIM_MISC_CTL_UART3IRSEL_MASK;
  (void)SIM_MISC_CTL_UART3IRSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_UART3IRSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_UART3IRSEL_SHIFT);
  (void)SIM_MISC_CTL_XBARPITOUTSEL_MASK;
  (void)SIM_MISC_CTL_XBARPITOUTSEL_SHIFT;
  (void)SIM_MISC_CTL_XBARPITOUTSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_XBARPITOUTSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_XBARPITOUTSEL_SHIFT);
  (void)SIM_MISC_CTL_EWMINSEL_MASK;
  (void)SIM_MISC_CTL_EWMINSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_EWMINSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_EWMINSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR0PLLCLKSEL_MASK;
  (void)SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR0PLLCLKSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR0PLLCLKSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR0SCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR0SCSSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR0SCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR0SCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR1SCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR1SCSSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR1SCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR1SCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR2SCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR2SCSSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR2SCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR2SCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR3SCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR3SCSSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR3SCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR3SCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR0PCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR0PCSSEL_SHIFT;
  (void)SIM_MISC_CTL_TMR0PCSSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR0PCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR0PCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR1PCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR1PCSSEL_SHIFT;
  (void)SIM_MISC_CTL_TMR1PCSSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR1PCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR1PCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR2PCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR2PCSSEL_SHIFT;
  (void)SIM_MISC_CTL_TMR2PCSSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR2PCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR2PCSSEL_SHIFT);
  (void)SIM_MISC_CTL_TMR3PCSSEL_MASK;
  (void)SIM_MISC_CTL_TMR3PCSSEL_SHIFT;
  (void)SIM_MISC_CTL_TMR3PCSSEL(1);
  SIM_MISC_CTL |= SIM_MISC_CTL_TMR3PCSSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_TMR3PCSSEL_SHIFT);
  (void)SIM_MISC_CTL_RTCCLKSEL_MASK;
  (void)SIM_MISC_CTL_RTCCLKSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_RTCCLKSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_RTCCLKSEL_SHIFT);
  (void)SIM_MISC_CTL_VREFBUFOUTEN_MASK;
  (void)SIM_MISC_CTL_VREFBUFOUTEN_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_VREFBUFOUTEN_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_VREFBUFOUTEN_SHIFT);
  (void)SIM_MISC_CTL_VREFBUFINSEL_MASK;
  (void)SIM_MISC_CTL_VREFBUFINSEL_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_VREFBUFINSEL_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_VREFBUFINSEL_SHIFT);
  (void)SIM_MISC_CTL_VREFBUFPD_MASK;
  (void)SIM_MISC_CTL_VREFBUFPD_SHIFT;
  SIM_MISC_CTL |= SIM_MISC_CTL_VREFBUFPD_MASK;
  SIM_MISC_CTL &= ~(1U << SIM_MISC_CTL_VREFBUFPD_SHIFT);
}

void test_SMC(void) {
  (void)SMC_BASE_PTR;
  SMC_PMPROT = SMC_PMPROT + 1;
  SMC_PMCTRL = SMC_PMCTRL + 1;
  SMC_STOPCTRL = SMC_STOPCTRL + 1;
  SMC_PMPROT_REG(SMC_BASE_PTR) = SMC_PMPROT_REG(SMC_BASE_PTR) + 1;
  (void)SMC_PMPROT_AVLLS_MASK;
  (void)SMC_PMPROT_AVLLS_SHIFT;
  SMC_PMPROT |= SMC_PMPROT_AVLLS_MASK;
  SMC_PMPROT &= ~(1U << SMC_PMPROT_AVLLS_SHIFT);
  (void)SMC_PMPROT_AVLP_MASK;
  (void)SMC_PMPROT_AVLP_SHIFT;
  SMC_PMPROT |= SMC_PMPROT_AVLP_MASK;
  SMC_PMPROT &= ~(1U << SMC_PMPROT_AVLP_SHIFT);
  SMC_PMCTRL_REG(SMC_BASE_PTR) = SMC_PMCTRL_REG(SMC_BASE_PTR) + 1;
  (void)SMC_PMCTRL_STOPM_MASK;
  (void)SMC_PMCTRL_STOPM_SHIFT;
  (void)SMC_PMCTRL_STOPM(1);
  SMC_PMCTRL |= SMC_PMCTRL_STOPM_MASK;
  SMC_PMCTRL &= ~(1U << SMC_PMCTRL_STOPM_SHIFT);
  (void)SMC_PMCTRL_STOPA_MASK;
  (void)SMC_PMCTRL_STOPA_SHIFT;
  SMC_PMCTRL |= SMC_PMCTRL_STOPA_MASK;
  SMC_PMCTRL &= ~(1U << SMC_PMCTRL_STOPA_SHIFT);
  (void)SMC_PMCTRL_RUNM_MASK;
  (void)SMC_PMCTRL_RUNM_SHIFT;
  (void)SMC_PMCTRL_RUNM(1);
  SMC_PMCTRL |= SMC_PMCTRL_RUNM_MASK;
  SMC_PMCTRL &= ~(1U << SMC_PMCTRL_RUNM_SHIFT);
  SMC_STOPCTRL_REG(SMC_BASE_PTR) = SMC_STOPCTRL_REG(SMC_BASE_PTR) + 1;
  (void)SMC_STOPCTRL_VLLSM_MASK;
  (void)SMC_STOPCTRL_VLLSM_SHIFT;
  (void)SMC_STOPCTRL_VLLSM(1);
  SMC_STOPCTRL |= SMC_STOPCTRL_VLLSM_MASK;
  SMC_STOPCTRL &= ~(1U << SMC_STOPCTRL_VLLSM_SHIFT);
  (void)SMC_STOPCTRL_PORPO_MASK;
  (void)SMC_STOPCTRL_PORPO_SHIFT;
  SMC_STOPCTRL |= SMC_STOPCTRL_PORPO_MASK;
  SMC_STOPCTRL &= ~(1U << SMC_STOPCTRL_PORPO_SHIFT);
  (void)SMC_STOPCTRL_PSTOPO_MASK;
  (void)SMC_STOPCTRL_PSTOPO_SHIFT;
  (void)SMC_STOPCTRL_PSTOPO(1);
  SMC_STOPCTRL |= SMC_STOPCTRL_PSTOPO_MASK;
  SMC_STOPCTRL &= ~(1U << SMC_STOPCTRL_PSTOPO_SHIFT);
  (void)SMC_PMSTAT_PMSTAT_MASK;
  (void)SMC_PMSTAT_PMSTAT_SHIFT;
  (void)SMC_PMSTAT_PMSTAT(1);
  SMC_PMSTAT |= SMC_PMSTAT_PMSTAT_MASK;
  SMC_PMSTAT &= ~(1U << SMC_PMSTAT_PMSTAT_SHIFT);
}

