kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/Test_MKM33Z5_v1_2.c
void test_SPI(void) {
  (void)SPI0_BASE_PTR;
  (void)SPI1_BASE_PTR;
  SPI0_BR = SPI0_BR + 1;
  SPI0_C2 = SPI0_C2 + 1;
  SPI0_C1 = SPI0_C1 + 1;
  SPI0_ML = SPI0_ML + 1;
  SPI0_MH = SPI0_MH + 1;
  SPI0_DL = SPI0_DL + 1;
  SPI0_DH = SPI0_DH + 1;
  SPI0_CI = SPI0_CI + 1;
  SPI0_C3 = SPI0_C3 + 1;
  SPI1_BR = SPI1_BR + 1;
  SPI1_C2 = SPI1_C2 + 1;
  SPI1_C1 = SPI1_C1 + 1;
  SPI1_ML = SPI1_ML + 1;
  SPI1_MH = SPI1_MH + 1;
  SPI1_DL = SPI1_DL + 1;
  SPI1_DH = SPI1_DH + 1;
  SPI1_CI = SPI1_CI + 1;
  SPI1_C3 = SPI1_C3 + 1;
  (void)SPI_S_RFIFOEF_MASK;
  (void)SPI_S_RFIFOEF_SHIFT;
  SPI0_S |= SPI_S_RFIFOEF_MASK;
  SPI0_S &= ~(1U << SPI_S_RFIFOEF_SHIFT);
  (void)SPI_S_TXFULLF_MASK;
  (void)SPI_S_TXFULLF_SHIFT;
  SPI0_S |= SPI_S_TXFULLF_MASK;
  SPI0_S &= ~(1U << SPI_S_TXFULLF_SHIFT);
  (void)SPI_S_TNEAREF_MASK;
  (void)SPI_S_TNEAREF_SHIFT;
  SPI0_S |= SPI_S_TNEAREF_MASK;
  SPI0_S &= ~(1U << SPI_S_TNEAREF_SHIFT);
  (void)SPI_S_RNFULLF_MASK;
  (void)SPI_S_RNFULLF_SHIFT;
  SPI0_S |= SPI_S_RNFULLF_MASK;
  SPI0_S &= ~(1U << SPI_S_RNFULLF_SHIFT);
  (void)SPI_S_MODF_MASK;
  (void)SPI_S_MODF_SHIFT;
  SPI0_S |= SPI_S_MODF_MASK;
  SPI0_S &= ~(1U << SPI_S_MODF_SHIFT);
  (void)SPI_S_SPTEF_MASK;
  (void)SPI_S_SPTEF_SHIFT;
  SPI0_S |= SPI_S_SPTEF_MASK;
  SPI0_S &= ~(1U << SPI_S_SPTEF_SHIFT);
  (void)SPI_S_SPMF_MASK;
  (void)SPI_S_SPMF_SHIFT;
  SPI0_S |= SPI_S_SPMF_MASK;
  SPI0_S &= ~(1U << SPI_S_SPMF_SHIFT);
  (void)SPI_S_SPRF_MASK;
  (void)SPI_S_SPRF_SHIFT;
  SPI0_S |= SPI_S_SPRF_MASK;
  SPI0_S &= ~(1U << SPI_S_SPRF_SHIFT);
  SPI_BR_REG(SPI0_BASE_PTR) = SPI_BR_REG(SPI0_BASE_PTR) + 1;
  SPI_BR_REG(SPI1_BASE_PTR) = SPI_BR_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_BR_SPR_MASK;
  (void)SPI_BR_SPR_SHIFT;
  (void)SPI_BR_SPR(1);
  SPI0_BR |= SPI_BR_SPR_MASK;
  SPI0_BR &= ~(1U << SPI_BR_SPR_SHIFT);
  (void)SPI_BR_SPPR_MASK;
  (void)SPI_BR_SPPR_SHIFT;
  (void)SPI_BR_SPPR(1);
  SPI0_BR |= SPI_BR_SPPR_MASK;
  SPI0_BR &= ~(1U << SPI_BR_SPPR_SHIFT);
  SPI_C2_REG(SPI0_BASE_PTR) = SPI_C2_REG(SPI0_BASE_PTR) + 1;
  SPI_C2_REG(SPI1_BASE_PTR) = SPI_C2_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_C2_SPC0_MASK;
  (void)SPI_C2_SPC0_SHIFT;
  SPI0_C2 |= SPI_C2_SPC0_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_SPC0_SHIFT);
  (void)SPI_C2_SPISWAI_MASK;
  (void)SPI_C2_SPISWAI_SHIFT;
  SPI0_C2 |= SPI_C2_SPISWAI_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_SPISWAI_SHIFT);
  (void)SPI_C2_RXDMAE_MASK;
  (void)SPI_C2_RXDMAE_SHIFT;
  SPI0_C2 |= SPI_C2_RXDMAE_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_RXDMAE_SHIFT);
  (void)SPI_C2_BIDIROE_MASK;
  (void)SPI_C2_BIDIROE_SHIFT;
  SPI0_C2 |= SPI_C2_BIDIROE_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_BIDIROE_SHIFT);
  (void)SPI_C2_MODFEN_MASK;
  (void)SPI_C2_MODFEN_SHIFT;
  SPI0_C2 |= SPI_C2_MODFEN_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_MODFEN_SHIFT);
  (void)SPI_C2_TXDMAE_MASK;
  (void)SPI_C2_TXDMAE_SHIFT;
  SPI0_C2 |= SPI_C2_TXDMAE_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_TXDMAE_SHIFT);
  (void)SPI_C2_SPIMODE_MASK;
  (void)SPI_C2_SPIMODE_SHIFT;
  SPI0_C2 |= SPI_C2_SPIMODE_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_SPIMODE_SHIFT);
  (void)SPI_C2_SPMIE_MASK;
  (void)SPI_C2_SPMIE_SHIFT;
  SPI0_C2 |= SPI_C2_SPMIE_MASK;
  SPI0_C2 &= ~(1U << SPI_C2_SPMIE_SHIFT);
  SPI_C1_REG(SPI0_BASE_PTR) = SPI_C1_REG(SPI0_BASE_PTR) + 1;
  SPI_C1_REG(SPI1_BASE_PTR) = SPI_C1_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_C1_LSBFE_MASK;
  (void)SPI_C1_LSBFE_SHIFT;
  SPI0_C1 |= SPI_C1_LSBFE_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_LSBFE_SHIFT);
  (void)SPI_C1_SSOE_MASK;
  (void)SPI_C1_SSOE_SHIFT;
  SPI0_C1 |= SPI_C1_SSOE_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_SSOE_SHIFT);
  (void)SPI_C1_CPHA_MASK;
  (void)SPI_C1_CPHA_SHIFT;
  SPI0_C1 |= SPI_C1_CPHA_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_CPHA_SHIFT);
  (void)SPI_C1_CPOL_MASK;
  (void)SPI_C1_CPOL_SHIFT;
  SPI0_C1 |= SPI_C1_CPOL_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_CPOL_SHIFT);
  (void)SPI_C1_MSTR_MASK;
  (void)SPI_C1_MSTR_SHIFT;
  SPI0_C1 |= SPI_C1_MSTR_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_MSTR_SHIFT);
  (void)SPI_C1_SPTIE_MASK;
  (void)SPI_C1_SPTIE_SHIFT;
  SPI0_C1 |= SPI_C1_SPTIE_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_SPTIE_SHIFT);
  (void)SPI_C1_SPE_MASK;
  (void)SPI_C1_SPE_SHIFT;
  SPI0_C1 |= SPI_C1_SPE_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_SPE_SHIFT);
  (void)SPI_C1_SPIE_MASK;
  (void)SPI_C1_SPIE_SHIFT;
  SPI0_C1 |= SPI_C1_SPIE_MASK;
  SPI0_C1 &= ~(1U << SPI_C1_SPIE_SHIFT);
  SPI_ML_REG(SPI0_BASE_PTR) = SPI_ML_REG(SPI0_BASE_PTR) + 1;
  SPI_ML_REG(SPI1_BASE_PTR) = SPI_ML_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_ML_Bits_MASK;
  (void)SPI_ML_Bits_SHIFT;
  (void)SPI_ML_Bits(1);
  SPI0_ML |= SPI_ML_Bits_MASK;
  SPI0_ML &= ~(1U << SPI_ML_Bits_SHIFT);
  SPI_MH_REG(SPI0_BASE_PTR) = SPI_MH_REG(SPI0_BASE_PTR) + 1;
  SPI_MH_REG(SPI1_BASE_PTR) = SPI_MH_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_MH_Bits_MASK;
  (void)SPI_MH_Bits_SHIFT;
  (void)SPI_MH_Bits(1);
  SPI0_MH |= SPI_MH_Bits_MASK;
  SPI0_MH &= ~(1U << SPI_MH_Bits_SHIFT);
  SPI_DL_REG(SPI0_BASE_PTR) = SPI_DL_REG(SPI0_BASE_PTR) + 1;
  SPI_DL_REG(SPI1_BASE_PTR) = SPI_DL_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_DL_Bits_MASK;
  (void)SPI_DL_Bits_SHIFT;
  (void)SPI_DL_Bits(1);
  SPI0_DL |= SPI_DL_Bits_MASK;
  SPI0_DL &= ~(1U << SPI_DL_Bits_SHIFT);
  SPI_DH_REG(SPI0_BASE_PTR) = SPI_DH_REG(SPI0_BASE_PTR) + 1;
  SPI_DH_REG(SPI1_BASE_PTR) = SPI_DH_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_DH_Bits_MASK;
  (void)SPI_DH_Bits_SHIFT;
  (void)SPI_DH_Bits(1);
  SPI0_DH |= SPI_DH_Bits_MASK;
  SPI0_DH &= ~(1U << SPI_DH_Bits_SHIFT);
  SPI_CI_REG(SPI0_BASE_PTR) = SPI_CI_REG(SPI0_BASE_PTR) + 1;
  SPI_CI_REG(SPI1_BASE_PTR) = SPI_CI_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_CI_SPRFCI_MASK;
  (void)SPI_CI_SPRFCI_SHIFT;
  SPI0_CI |= SPI_CI_SPRFCI_MASK;
  SPI0_CI &= ~(1U << SPI_CI_SPRFCI_SHIFT);
  (void)SPI_CI_SPTEFCI_MASK;
  (void)SPI_CI_SPTEFCI_SHIFT;
  SPI0_CI |= SPI_CI_SPTEFCI_MASK;
  SPI0_CI &= ~(1U << SPI_CI_SPTEFCI_SHIFT);
  (void)SPI_CI_RNFULLFCI_MASK;
  (void)SPI_CI_RNFULLFCI_SHIFT;
  SPI0_CI |= SPI_CI_RNFULLFCI_MASK;
  SPI0_CI &= ~(1U << SPI_CI_RNFULLFCI_SHIFT);
  (void)SPI_CI_TNEAREFCI_MASK;
  (void)SPI_CI_TNEAREFCI_SHIFT;
  SPI0_CI |= SPI_CI_TNEAREFCI_MASK;
  SPI0_CI &= ~(1U << SPI_CI_TNEAREFCI_SHIFT);
  (void)SPI_CI_RXFOF_MASK;
  (void)SPI_CI_RXFOF_SHIFT;
  SPI0_CI |= SPI_CI_RXFOF_MASK;
  SPI0_CI &= ~(1U << SPI_CI_RXFOF_SHIFT);
  (void)SPI_CI_TXFOF_MASK;
  (void)SPI_CI_TXFOF_SHIFT;
  SPI0_CI |= SPI_CI_TXFOF_MASK;
  SPI0_CI &= ~(1U << SPI_CI_TXFOF_SHIFT);
  (void)SPI_CI_RXFERR_MASK;
  (void)SPI_CI_RXFERR_SHIFT;
  SPI0_CI |= SPI_CI_RXFERR_MASK;
  SPI0_CI &= ~(1U << SPI_CI_RXFERR_SHIFT);
  (void)SPI_CI_TXFERR_MASK;
  (void)SPI_CI_TXFERR_SHIFT;
  SPI0_CI |= SPI_CI_TXFERR_MASK;
  SPI0_CI &= ~(1U << SPI_CI_TXFERR_SHIFT);
  SPI_C3_REG(SPI0_BASE_PTR) = SPI_C3_REG(SPI0_BASE_PTR) + 1;
  SPI_C3_REG(SPI1_BASE_PTR) = SPI_C3_REG(SPI1_BASE_PTR) + 1;
  (void)SPI_C3_FIFOMODE_MASK;
  (void)SPI_C3_FIFOMODE_SHIFT;
  SPI0_C3 |= SPI_C3_FIFOMODE_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_FIFOMODE_SHIFT);
  (void)SPI_C3_RNFULLIEN_MASK;
  (void)SPI_C3_RNFULLIEN_SHIFT;
  SPI0_C3 |= SPI_C3_RNFULLIEN_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_RNFULLIEN_SHIFT);
  (void)SPI_C3_TNEARIEN_MASK;
  (void)SPI_C3_TNEARIEN_SHIFT;
  SPI0_C3 |= SPI_C3_TNEARIEN_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_TNEARIEN_SHIFT);
  (void)SPI_C3_INTCLR_MASK;
  (void)SPI_C3_INTCLR_SHIFT;
  SPI0_C3 |= SPI_C3_INTCLR_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_INTCLR_SHIFT);
  (void)SPI_C3_RNFULLF_MARK_MASK;
  (void)SPI_C3_RNFULLF_MARK_SHIFT;
  SPI0_C3 |= SPI_C3_RNFULLF_MARK_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_RNFULLF_MARK_SHIFT);
  (void)SPI_C3_TNEAREF_MARK_MASK;
  (void)SPI_C3_TNEAREF_MARK_SHIFT;
  SPI0_C3 |= SPI_C3_TNEAREF_MARK_MASK;
  SPI0_C3 &= ~(1U << SPI_C3_TNEAREF_MARK_SHIFT);
}

void test_SysTick(void) {
  (void)SysTick_BASE_PTR;
  SYST_CSR = SYST_CSR + 1;
  SYST_RVR = SYST_RVR + 1;
  SYST_CVR = SYST_CVR + 1;
  SysTick_CSR_REG(SysTick_BASE_PTR) = SysTick_CSR_REG(SysTick_BASE_PTR) + 1;
  (void)SysTick_CSR_ENABLE_MASK;
  (void)SysTick_CSR_ENABLE_SHIFT;
  SYST_CSR |= SysTick_CSR_ENABLE_MASK;
  SYST_CSR &= ~(1U << SysTick_CSR_ENABLE_SHIFT);
  (void)SysTick_CSR_TICKINT_MASK;
  (void)SysTick_CSR_TICKINT_SHIFT;
  SYST_CSR |= SysTick_CSR_TICKINT_MASK;
  SYST_CSR &= ~(1U << SysTick_CSR_TICKINT_SHIFT);
  (void)SysTick_CSR_CLKSOURCE_MASK;
  (void)SysTick_CSR_CLKSOURCE_SHIFT;
  SYST_CSR |= SysTick_CSR_CLKSOURCE_MASK;
  SYST_CSR &= ~(1U << SysTick_CSR_CLKSOURCE_SHIFT);
  (void)SysTick_CSR_COUNTFLAG_MASK;
  (void)SysTick_CSR_COUNTFLAG_SHIFT;
  SYST_CSR |= SysTick_CSR_COUNTFLAG_MASK;
  SYST_CSR &= ~(1U << SysTick_CSR_COUNTFLAG_SHIFT);
  SysTick_RVR_REG(SysTick_BASE_PTR) = SysTick_RVR_REG(SysTick_BASE_PTR) + 1;
  (void)SysTick_RVR_RELOAD_MASK;
  (void)SysTick_RVR_RELOAD_SHIFT;
  (void)SysTick_RVR_RELOAD(1);
  SYST_RVR |= SysTick_RVR_RELOAD_MASK;
  SYST_RVR &= ~(1U << SysTick_RVR_RELOAD_SHIFT);
  SysTick_CVR_REG(SysTick_BASE_PTR) = SysTick_CVR_REG(SysTick_BASE_PTR) + 1;
  (void)SysTick_CVR_CURRENT_MASK;
  (void)SysTick_CVR_CURRENT_SHIFT;
  (void)SysTick_CVR_CURRENT(1);
  SYST_CVR |= SysTick_CVR_CURRENT_MASK;
  SYST_CVR &= ~(1U << SysTick_CVR_CURRENT_SHIFT);
  (void)SysTick_CALIB_TENMS_MASK;
  (void)SysTick_CALIB_TENMS_SHIFT;
  (void)SysTick_CALIB_TENMS(1);
  SYST_CALIB |= SysTick_CALIB_TENMS_MASK;
  SYST_CALIB &= ~(1U << SysTick_CALIB_TENMS_SHIFT);
  (void)SysTick_CALIB_SKEW_MASK;
  (void)SysTick_CALIB_SKEW_SHIFT;
  SYST_CALIB |= SysTick_CALIB_SKEW_MASK;
  SYST_CALIB &= ~(1U << SysTick_CALIB_SKEW_SHIFT);
  (void)SysTick_CALIB_NOREF_MASK;
  (void)SysTick_CALIB_NOREF_SHIFT;
  SYST_CALIB |= SysTick_CALIB_NOREF_MASK;
  SYST_CALIB &= ~(1U << SysTick_CALIB_NOREF_SHIFT);
}

